[{"vimeoId":"95782084","title":"a few apples short of a bushel","description":"\"A few apples short of a bushel\": not a smart person; stupid; retarded.","transcript":"Come on girls, there's no reasoning with that one: she is a few apples short of a bushel.","imgSrc":"http://i.vimeocdn.com/video/475765329_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782130","title":"a foot in the door","description":"\"A foot in the door\": a first step on your way to your goal.","transcript":"﻿They just don't know how to get a foot in the door and it really  does require more than… even a wiliness to do it, it really does require real action.","imgSrc":"http://i.vimeocdn.com/video/475765344_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88520488","title":"a golden goose","description":"\"A golden goose\" - a legendary goose that laid one golden egg a day and was killed by its impatient owner,  who wanted all the gold immediately.","transcript":"But Putin knows how Britain works and he knows that British government is never going to kill the golden oligarch goose that feeds London's elites.- Marc, do you share that?","imgSrc":"http://i.vimeocdn.com/video/467008721_100x75.jpg","ruTranscript":"Но Путин знает, как работают британцы, и что их правительство никогда не станет действовать против олигарха, который кормит лондонскую элиту. - Марк, вы с этим согласны?","ruDescription":"Гусыня-герой сказки, которая несла по золотому яйцу в день и была убита своим нетерпеливым хозяином, который хотел получить все золото сразу."},{"vimeoId":"88520495","title":"a needle in a haystack","description":"\"A needle in a haystack\" is something that is impossible or extremely difficult to find, especially because the area you have to search is too large.","transcript":"But it's like looking for a needle in a haystack here. They find fragments of what may be bombs...","imgSrc":"http://i.vimeocdn.com/video/467008725_100x75.jpg","ruTranscript":"Но это как искать иголку в стоге сена. Они находят осколки, которые могут быть осколками бомб…","ruDescription":"То, что невозможно или очень трудно найти, особенно потому, что территория осуществления поиска слишком велика."},{"vimeoId":"88520509","title":"a needle in a haystack","description":"\"A needle in a haystack\" is something that is impossible or extremely difficult to find, especially because the area you have to search is too large.","transcript":"Often it seems trying to find a positive story in Afghanistan is like searching for a needle in a  haystack.","imgSrc":"http://i.vimeocdn.com/video/467008732_100x75.jpg","ruTranscript":"Часто кажется, что найти позитивную историю из Афганистана - то же самое, что искать иголку в стоге сена.","ruDescription":"То, что невозможно или очень трудно найти, особенно потому, что территория осуществления поиска слишком велика."},{"vimeoId":"93052955","title":"a sight for sore eyes","description":"\"A sight for sore eyes\":a relieving sight; a person who is pleasant to see.","transcript":"Hi daddy. You're a sight for sore eyes.","imgSrc":"http://i.vimeocdn.com/video/472988340_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782160","title":"a thing of the past","description":"\"A thing of the past\": something that no longer happens.","transcript":"Family farms are going out of business and the production is being done by corporations and industrial-type farming so the \"father and a son\" and… or \"two sons\", you know, raising cattle or raising the corn or doing whatever is becoming a definite thing in the past.","imgSrc":"http://i.vimeocdn.com/video/475765430_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87951036","title":"a whole new ball game","description":"\"a whole new ball game\" is a completely different situation, often one which is difficult or which you know very little about","transcript":"It's a whole new ball game than it is today.","imgSrc":"http://i.vimeocdn.com/video/466215824_100x75.jpg","ruTranscript":"Это совсем другая ситуация, нежели сегодня.","ruDescription":"Абсолютно другая ситуация, зачастую трудная или малознакомая"},{"vimeoId":"88091426","title":"AC/DC","description":"AC/DC: 1) Alternating current/direct current; 2) Bisexual: A guy who would turn to any page in a phone book, point randomly to a name, call it and f...k it if it agreed.","transcript":"AC/DC, She's got some other lover as well as me, AC/DC, she's got some other woman as well as me She's got some other woman as well as me","imgSrc":"http://i.vimeocdn.com/video/466407209_100x75.jpg","ruTranscript":"У нее есть другая любовница, как и у меня. У нее другая, как и у меня. У нее другая, как и у меня.","ruDescription":"1. Переменного/постоянного тока (об электроустройствах); 2. Бисексуал - человек, который испытывает желание к представителям обоих полов"},{"vimeoId":"86387133","title":"ace in the hole","description":"An “ace in the hole”  (American) is an advantage that you have that other people do not know about.","transcript":"But the starkest contrast is really an ace in the hole for Barak Obama is really the ability he has to change the electorate.","imgSrc":"http://i.vimeocdn.com/video/464039085_100x75.jpg","ruTranscript":"Но самое важное отличие в том, что у Обамы есть туз в рукаве - способность влиять на сознание избирателей.","ruDescription":"Преимущество, о котором не знают другие люди."},{"vimeoId":"92601921","title":"acid test","description":"","transcript":"","imgSrc":"http://i.vimeocdn.com/video/472372851_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86387137","title":"acid test","description":"An “acid test” - a test which will really prove the value, quality, or truth of something","transcript":"An acid test for leadership is how you treat those you outrank, or as president Truman once said, “how you treat those who can’t talk back”.","imgSrc":"http://i.vimeocdn.com/video/464039097_100x75.jpg","ruTranscript":"Настоящая проверка лидерских качеств - это ваше отношение к тем, чья должность ниже вашей, или, как однажды сказал президент США Трумэн, \"отношение к тем, кто не может вам ответить\".","ruDescription":"Проверка, которая по-настоящему показывает цену, качество или правдивость чего-либо."},{"vimeoId":"86387167","title":"Act of God","description":"An Act of God is a legal term for events outside human control, such as sudden floods or other natural disasters, for which no one can be held responsible.","transcript":"Yeah, but what you and I know this was an Act of God. And I’m going fight to get the NTSB to add “Act of God”  as one of the probable causes.","imgSrc":"http://i.vimeocdn.com/video/464039170_100x75.jpg","ruTranscript":"Да, но мы оба знаем, что это было дело рук Божьих. И я буду бороться с комитетом по безопасности транспорта, пока они не добавят пункт \"Дело рук Божьих\" в список возможных причин.","ruDescription":"Юридический термин, означаюший события, неподвластные человеку, такие как внезапные наводнения или другие экологические катастрофы, ответственность за которые никто не несет."},{"vimeoId":"86387155","title":"Act of God","description":"An Act of God is a legal term for events outside human control, such as sudden floods or other natural disasters, for which no one can be held responsible.","transcript":"…that the extreme inequality that we see in our country, it’s not a natural phenomenon, it’s not an Act of God. It’s a deliberate result of the set of tax policies over 20 years.","imgSrc":"http://i.vimeocdn.com/video/464039092_100x75.jpg","ruTranscript":"…что ужасное неравенство в нашей стране не есть естественное явление, это не Божий замысел. Это запланированный результат особой системы налогообложения последних 20 лет.","ruDescription":"Юридический термин, означаюший события, неподвластные человеку, такие как внезапные наводнения или другие экологические катастрофы, ответственность за которые никто не несет."},{"vimeoId":"87408419","title":"ad hoc","description":"For the specific purpose, case, or situation at hand and for no other.","transcript":"That's a tricky thing to do though, because establishing an ad hoc way it does not have the same patterns of cooperation as the NATO Council does.","imgSrc":"http://i.vimeocdn.com/video/465454261_100x75.jpg","ruTranscript":"Но это не так просто сделать, так как им не хватает системы взаимодействия как у Совета НАТО для того, чтобы придумать подходящий способ.","ruDescription":"Применимый исключительно для данной цели, случая или ситуации."},{"vimeoId":"86387186","title":"against the clock","description":"“against the clock” - in a great hurry to get something done before a particular time.","transcript":"We’ve been racing against the clock to get ahead of the virus.","imgSrc":"http://i.vimeocdn.com/video/464039181_100x75.jpg","ruTranscript":"Мы торопились для того, чтобы опередить вирус.","ruDescription":"В сильной спешке сделать что-либо до определенного момента времени."},{"vimeoId":"86387203","title":"ahead of the curve","description":"ahead of the curve (US) : faster about doing something than other people, companies, etc.","transcript":"We can grow jobs here in America by investing in R&D, coming up with the new product line, making certain we’re ahead of a curve on science and technology opportunities that are available to this nation.","imgSrc":"http://i.vimeocdn.com/video/464039191_100x75.jpg","ruTranscript":"Мы можем бороться с безработицей, вкладывая средства в исследования и разработки, создавая новые продукты и укрепляя наши позиции как лидеров в научных и технических разработках, доступных в нашей стране.","ruDescription":"Быстрее в каком-либо деле, нежели другие люди, компании и т.д."},{"vimeoId":"94166882","title":"all ears","description":"\"To be all ears\": to listen very carefully; to concentrate your attention on whats you've being told","transcript":"I've got the devil in my blood telling me what to do — and I'm all ears","imgSrc":"http://i.vimeocdn.com/video/474106723_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93052963","title":"all ears","description":"\"To be all ears\": to listen very carefully; to concentrate your attention on whats you've being told","transcript":"and in terms of all those highly objectionable issues that I have lined a minute ago which of course go to the substance of the bill, I would be all ears","imgSrc":"http://i.vimeocdn.com/video/472988369_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87951043","title":"all for","description":"In support of something.","transcript":"Let's promote alternatives such as electric vehicles. I'm all for that.","imgSrc":"http://i.vimeocdn.com/video/466215826_100x75.jpg","ruTranscript":"Нам следует поддерживать такие альтернативы как электромобили. Я всецело это поддерживаю.","ruDescription":"В поддержку чего-либо."},{"vimeoId":"87951055","title":"all for","description":"In support of something.","transcript":"I'm all for punishing Assad and I'm all against using any kind of chemichal weapons.","imgSrc":"http://i.vimeocdn.com/video/466215829_100x75.jpg","ruTranscript":"Я за то, чтобы Асад был наказан и против применения любого химического оружия.","ruDescription":"В поддержку чего-либо."},{"vimeoId":"92602038","title":"all hell broke loose","description":"","transcript":"","imgSrc":"http://i.vimeocdn.com/video/472373041_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88520534","title":"all hell broke loose","description":"\"All hell broke loose\": all sorts of wild or terrible things happened.","transcript":"Within hours of President Yanukovich declaring a truce all hell broke loose.","imgSrc":"http://i.vimeocdn.com/video/467008784_100x75.jpg","ruTranscript":"В течение нескольких часов после того, как Янукович согласился на перемирие, началось самое ужасное.","ruDescription":"Произошли все возможные беды и злоключения."},{"vimeoId":"88520543","title":"all hell broke loose","description":"\"All hell broke loose\": all sorts of wild or terrible things happened.","transcript":"And then all hell broke loose outside the base. There was protest, there was shouting, there were people yelling at us at the gate.","imgSrc":"http://i.vimeocdn.com/video/467008787_100x75.jpg","ruTranscript":"А после этого за стенами базы начался ад. Была акция протеста, все кричали, у ворот базы толпились люди и кричали на нас.","ruDescription":"Произошли все возможные беды и злоключения."},{"vimeoId":"87951072","title":"all in all","description":"\"All in all\": taking everything into account.","transcript":"Teacher! Leave them kids alone! All in all you're just another brick in the wall.","imgSrc":"http://i.vimeocdn.com/video/466215848_100x75.jpg","ruTranscript":"Учитель! Оставь детей в покое! В общем, ты для них всего лишь один из кирпичиков в стене.","ruDescription":"В целом."},{"vimeoId":"89276999","title":"all-in","description":"All-in: total commitment; wagering everything you have all at once.","transcript":"We know that the nation that goes all-in on innovation today will own the global economy tomorrow.","imgSrc":"http://i.vimeocdn.com/video/467957770_100x75.jpg","ruTranscript":"Все мы знаем, что страна, которая сегодня вложится в инновации, завтра будет крупнейшим игроком в мировой экономике.","ruDescription":"Безусловная приверженность чему-либо; поставить на кон все, что имеется."},{"vimeoId":"89277008","title":"all-in","description":"All-in: total commitment; wagering everything you have all at once.","transcript":"So Sanjay, I know you've done 180 on medical marijuana but you are really now all-in. You're actually in the grow room. Please find info about \"180\" idiom in our library.","imgSrc":"http://i.vimeocdn.com/video/467957780_100x75.jpg","ruTranscript":"Сэнджей, я знаю, что ты координально изменил отношение людей к лечебной марихуане, но сейчас ты выкладываешься на все сто - ты на связи с нами из помещения, где ее выращивают.","ruDescription":"Безусловная приверженность чему-либо; поставить на кон все, что имеется."},{"vimeoId":"87408428","title":"at a loss for words","description":"unable to think of something to say","transcript":"He was someone who, of course, was never at the loss for words. Many of those words were memorable.","imgSrc":"http://i.vimeocdn.com/video/465454268_100x75.jpg","ruTranscript":"Он был одним из тех людей, которые всегда найдут, что сказать. И многое из того, что он говорил, запоминалось надолго.","ruDescription":"Не в состоянии сказать что-либо."},{"vimeoId":"88520562","title":"at hand","description":"\"At hand\" means close by in time or space.","transcript":"There is no final status solution at hand now.","imgSrc":"http://i.vimeocdn.com/video/467008811_100x75.jpg","ruTranscript":"Мы пока не пришли к окончательному решению по статусу.","ruDescription":"Рядом, во времени или пространстве."},{"vimeoId":"93052981","title":"at large","description":"\"At large\":not in captivity; escaped and not caught .","transcript":"The preparations follows this terrorist attacks on two markets and a bus and the perpetrators apparently still at large.","imgSrc":"http://i.vimeocdn.com/video/472988376_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93052988","title":"at large","description":"\"At large\":not in captivity; escaped and not caught .","transcript":"But potentially there are two other shooters at large right now.","imgSrc":"http://i.vimeocdn.com/video/472988378_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93052974","title":"at large","description":"\"At large\":not in captivity; escaped and not caught .","transcript":"And the question remains, where is he? One man who's met Colonel Gadaffi says he's remains a threat as long as he's at large.","imgSrc":"http://i.vimeocdn.com/video/472988373_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88091453","title":"at my alley","description":"Right down someone's alley: ideally suited to one's interests or abilities.","transcript":"This type \"no-no\" situation was right at my alley:I knew self-destructive but I didn't care.","imgSrc":"http://i.vimeocdn.com/video/466407308_100x75.jpg","ruTranscript":"Ситуации типа \"нет-нет\" были по моей части: я был знаком с саморазрушением, но мне было плевать.","ruDescription":"Идеально подходящий чьим-либо интересам или способностям."},{"vimeoId":"86836189","title":"at the hat drop","description":"If you do something “at the drop of a hat”, you do it suddenly and easily, often without any preparation.","transcript":"…people suing this country at the drop of a much lighter hat.","imgSrc":"http://i.vimeocdn.com/video/464657591_100x75.jpg","ruTranscript":"…люди, которым намного проще подать в суд на государство.","ruDescription":"Внезапно и без усилий, зачастую без подготовки. Пожалуйста, ознакомьтесь со значением слова \"rock'n'roll\" в нашей коллекции."},{"vimeoId":"86836206","title":"at the hat drop","description":"If you do something “at the drop of a hat”, you do it suddenly and easily, often without any preparation.","transcript":"What difference does it make? Why leave a living witness? Drop of the hat – these guys were rock’n’roll.","imgSrc":"http://i.vimeocdn.com/video/464657597_100x75.jpg","ruTranscript":"Что это изменит? Зачем оставлять свидетеля в живых? Один миг - и эти парни начали стрелять.","ruDescription":"Внезапно и без усилий, зачастую без подготовки. Пожалуйста, ознакомьтесь со значением слова \"rock'n'roll\" в нашей коллекции."},{"vimeoId":"95782210","title":"average Joe","description":"\"Average Joe\": an ordinary person.","transcript":"The people who cause this mess are still making several figure incomes and average Joes are suffering.","imgSrc":"http://i.vimeocdn.com/video/475765428_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86836220","title":"axe to grind","description":"To have “an axe to grind” is to have a selfish reason for saying or doing something.","transcript":"They have no particular axe to drive.","imgSrc":"http://i.vimeocdn.com/video/464657653_100x75.jpg","ruTranscript":"У них нет особого личного интереса в этом деле.","ruDescription":"Иметь личную выгоду в том, чтобы сказать или сделать что-либо."},{"vimeoId":"86836234","title":"baby bust","description":"“Baby bust” is a sudden decline in the birthrate, especially the one in the United States from about 1961 to 1981.","transcript":"There was a “baby bust” generation … kids being born in the Depression, very low birth rates.","imgSrc":"http://i.vimeocdn.com/video/464657641_100x75.jpg","ruTranscript":"Это было поколение демографического кризиса… Дети, рожденные в период Великой Депрессии, очень низкие показатели рождаемости.","ruDescription":"Неожиданный спад рождаемости, в частности тот, который произошел в США в период с 1961 по 1981 года."},{"vimeoId":"88091473","title":"back burner","description":"On the \"back burner\": on hold or suspended temporarily (putting a pot that needs less active attention on a back burner of a stove, leaving space for pots that need to be stirred.","transcript":"Probably pushes it way back on the back burner for political reasons. I mean it will be much more difficult to justify military action at this stage.","imgSrc":"http://i.vimeocdn.com/video/466407284_100x75.jpg","ruTranscript":"Наверное, этот вопрос откладывается в долгий ящик по политическим причинам. Я имею в виду то, что оправдать военные действия на этой стадии будет трудно.","ruDescription":"Быть временно отложенным на потом."},{"vimeoId":"86836247","title":"back-to-back","description":"If things happen back-to-back, they are directly one after another.","transcript":"claiming responsibility for two back-to-back suicide bombings last month.","imgSrc":"http://i.vimeocdn.com/video/464657658_100x75.jpg","ruTranscript":"…взяв на себя ответственность за действия двух террористов-смертников, совершивших взрывы в прошлом месяце.","ruDescription":"Друг за другом, подряд."},{"vimeoId":"87408437","title":"backhanded compliment","description":"What might at first sound like a compliment but could really be taken as an insult when considered in its entirety.","transcript":"And that is not backhanded compliment: we have fine hour in under the tenure of any president of the United States of America.","imgSrc":"http://i.vimeocdn.com/video/465454331_100x75.jpg","ruTranscript":"И это не ложный комплимент: у нас есть свой звездный час при каждом президенте Америки.","ruDescription":"То, что может звучать как комплимент, но при более детальном рассмотрении может быть воспринято как оскорбление."},{"vimeoId":"93053092","title":"bad apple","description":"\"Bad apple\": a single \"bad\" person that could ruin the whole sutiation .","transcript":"Now whether this is a bad apple operating improperly or whether this is to some degree systemic I don't know.","imgSrc":"http://i.vimeocdn.com/video/472988529_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86836266","title":"bad blood","description":"“Bad blood” is a feeling of intense hatred or hostility; enmity.","transcript":"There is a lot of bad blood on this but I think we can work through this.","imgSrc":"http://i.vimeocdn.com/video/464657750_100x75.jpg","ruTranscript":"Вокруг этой ситуации много конфликтов, но я думаю что мы сможем это решить.","ruDescription":"Чувство сильной ненависти или вражды."},{"vimeoId":"87408446","title":"bad bone","description":"\"Not have a type of bone in your body\" means to have none of the characteristic described. A \"bad bone\" is a person with a bad behavior or bad attitude, or someone whose acts have negative effects on others.","transcript":"I don't think the kid's got a bad bone in his body. I just think he's a little misplaced.","imgSrc":"http://i.vimeocdn.com/video/465454336_100x75.jpg","ruTranscript":"Я не думаю, что этот парень плохой. Мне кажется, он не на своем месте.","ruDescription":"Человек , который дурно себя ведет или имеет плохой характер, либо человек, чье поведение плохо влияет на других."},{"vimeoId":"88520842","title":"banner year","description":"\"banner year\" is a year which is good because something is successful.","transcript":"The economics of the installation has been questioned but the project kept what many are calling a banner year for American solar power - 2013.","imgSrc":"http://i.vimeocdn.com/video/467009157_100x75.jpg","ruTranscript":"Экономические показатели проекта были неоднозначными, но благодаря ему 2013 год остался успешным для солнечной энергетики США.","ruDescription":"Успешный год."},{"vimeoId":"88422539","title":"bargaining chip","description":"\"Bargaining chip\" is something to be used (traded) in negotiations.","transcript":"It's disappointed that Kenneth Bae will not be used as a political bargaining chip.","imgSrc":"http://i.vimeocdn.com/video/466874429_100x75.jpg","ruTranscript":"Жаль, что Кеннета Бэя не используют как политическую разменную монету.","ruDescription":"Что-либо, что можно использовать или обменять в ходе переговоров."},{"vimeoId":"86836292","title":"basket case","description":"“Basket case” refers to someone in a hopeless mental condition, but in origin it had a physical meaning. In the grim slang of the British army during World War I, it referred to a quadruple amputee.","transcript":"One area in your future command that ah… is just still a basket case.","imgSrc":"http://i.vimeocdn.com/video/464657754_100x75.jpg","ruTranscript":"Одно поле деятельности, которое будет под вашим командованием, эм… До сих пор в безнадежном состоянии.","ruDescription":"Человек в безнадежном психологическом состоянии, но изначально идиома применялась к физическому состоянию: в грубом сленге британских солдат времен Первой мировой войны так называли солдат, у которых ампутированы все четыре конечности."},{"vimeoId":"86836325","title":"bat an eye","description":"“Not bat an eye” is to not show any shock or surprise.","transcript":"It’s about investing in our country. Someone on the other side did not bat an eye when they voted to use American tax dollars to rebuild Iraq.","imgSrc":"http://i.vimeocdn.com/video/464657900_100x75.jpg","ruTranscript":"Самое важное - инвестиции в нашу экономику. Кое-кто из наших оппонентов и бровью не повел, когда они голосовали за восстановление Ирака за счет американских налогоплательщиков.","ruDescription":"Не показать своего удивления."},{"vimeoId":"88520864","title":"beauty is in the eye of the beholder","description":"The phrase beauty is in the eye of the beholder typically means that someone can be beautiful based on the person that is seeing it. It means that each person sees beauty in a different fashion.","transcript":"But what's this? His t-shirt! Ah...Proves that beauty is not only in the eye of the beholder -  it is also in the nose.","imgSrc":"http://i.vimeocdn.com/video/467009220_100x75.jpg","ruTranscript":"А это что? Его футболка! Ох, это подтверждает, что красоту каждый не только видит, но и на запах чувствует по-своему.","ruDescription":"Обычно значит что можно быть красивым на чей-либо взгляд, то есть то, что каждый видит красоту по-своему."},{"vimeoId":"88520874","title":"beauty is in the eye of the beholder","description":"The phrase beauty is in the eye of the beholder typically means that someone can be beautiful based on the person that is seeing it. It means that each person sees beauty in a different fashion.","transcript":"Beauty is in the eye of the beholder, of course.","imgSrc":"http://i.vimeocdn.com/video/467009243_100x75.jpg","ruTranscript":"Каждый видит красоту по-своему, безусловно.","ruDescription":"Обычно значит что можно быть красивым на чей-либо взгляд, то есть то, что каждый видит красоту по-своему."},{"vimeoId":"88520853","title":"beauty is in the eye of the beholder","description":"The phrase beauty is in the eye of the beholder typically means that someone can be beautiful based on the person that is seeing it. It means that each person sees beauty in a different fashion.","transcript":"They say beauty is in the eye of the beholder.","imgSrc":"http://i.vimeocdn.com/video/467009162_100x75.jpg","ruTranscript":"Говорят, каждый видит красоту по-своему.","ruDescription":"Обычно значит что можно быть красивым на чей-либо взгляд, то есть то, что каждый видит красоту по-своему."},{"vimeoId":"86836375","title":"bedrock","description":"\"Bedrock\" is any firm foundation or the fundamental principles.","transcript":"And that quote, that sentiment is one that's really fundamental and bedrock to my thinking.","imgSrc":"http://i.vimeocdn.com/video/464657834_100x75.jpg","ruTranscript":"И эта цитата, эта мысль является для меня фундаментальной и основной.","ruDescription":"Основа или основные принципы любой компании."},{"vimeoId":"86836342","title":"bedrock","description":"\"Bedrock\" is any firm foundation or the fundamental principles.","transcript":"The mining industry is a bedrock of South African economy.","imgSrc":"http://i.vimeocdn.com/video/464657819_100x75.jpg","ruTranscript":"Горнодобывающая отрасль является основой Южно-Африканской экономики.","ruDescription":"Основа или основные принципы любой компании."},{"vimeoId":"87408485","title":"behind bars","description":"To be \"behind bars\" is to be imprisoned, particularly inside a jail cell (usually the type with vertical metal bars that keep inmates from escaping).","transcript":"He has no future. Saved from his smugglers but still sentenced for a life behind bars.","imgSrc":"http://i.vimeocdn.com/video/465454401_100x75.jpg","ruTranscript":"У него нет будущего. Его спасли от контрабандистов, но посадили в тюрьму пожизненно.","ruDescription":"Находиться в тюрьме, в камере."},{"vimeoId":"87408470","title":"behind bars","description":"To be \"behind bars\" is to be imprisoned, particularly inside a jail cell (usually the type with vertical metal bars that keep inmates from escaping).","transcript":"And this isn't the first case where cat being used to deliver illegal goods behind bars.","imgSrc":"http://i.vimeocdn.com/video/465454349_100x75.jpg","ruTranscript":"И это не первый случай, когда кошек использовали, чтобы пронести в тюрьму запрещенные предметы.","ruDescription":"Находиться в тюрьме, в камере."},{"vimeoId":"87408459","title":"behind bars","description":"To be \"behind bars\" is to be imprisoned, particularly inside a jail cell (usually the type with vertical metal bars that keep inmates from escaping).","transcript":"Born behind bars. Should female inmates raise their babes behind bars?","imgSrc":"http://i.vimeocdn.com/video/465454338_100x75.jpg","ruTranscript":"Рожденные за решеткой. Следует ли матерям, находящимся в тюрьме, растить там своих детей?","ruDescription":"Находиться в тюрьме, в камере."},{"vimeoId":"87408502","title":"behind bars","description":"To be \"behind bars\" is to be imprisoned, particularly inside a jail cell (usually the type with vertical metal bars that keep inmates from escaping).","transcript":"Protesters have been sentenced for life behind bars.","imgSrc":"http://i.vimeocdn.com/video/465454385_100x75.jpg","ruTranscript":"Демонстрантов приговорили к пожизненному заключению.","ruDescription":"Находиться в тюрьме, в камере."},{"vimeoId":"88092573","title":"behind the scenes","description":"\"Behind the scenes\": without receiving credit or fame; out of public view. Please find info about other two idioms used in this video in our library.","transcript":"You know, he has had Steve Jobs's ear,he's been really been running the show behind the scenes for quite some time.","imgSrc":"http://i.vimeocdn.com/video/466408875_100x75.jpg","ruTranscript":"Вы знаете, что он имеет влияние на Стива Джобса и на самом деле какое-то время он был главным, незаметно для всех.","ruDescription":"Не получая почестей или славы, незаметно для общественности. Пожалуйста, ознакомьтесь с другими двумя идиомами, использованными в этом сюжете, в нашей коллекции."},{"vimeoId":"88520897","title":"bellwether","description":"\"A bellwether\" is a wether or other male sheep that leads the flock, usually bearing a bell; a person or thing that assumes the leadership;  a person or thing that shows the existence or direction of a trend.","transcript":"A joint venture of the North and South that produced half billion dollars in goods in 2012. It is a bellwether for the real state of relations between North and South.","imgSrc":"http://i.vimeocdn.com/video/467009237_100x75.jpg","ruTranscript":"Совместное предприятие севера и юга произвело товаров на сумму полмиллиарда долларов в 2012 году. Это показывает реальную ситуацию в отношениях между севером и югом.","ruDescription":"Валух (кастрированный баран) или обычный баран, который ведет за собой стадо и носит на шее колокольчик; человек или предмет, который стал лидером; человек или предмет, указывающий на существование или направление тенденции."},{"vimeoId":"87951079","title":"boots on the ground","description":"\"Boots on the ground\": The ground forces actually fighting in a war or conflict at the time of speaking,  rather than troops not engaged or being transported to the fighting.","transcript":"My first message: no boots on the ground.","imgSrc":"http://i.vimeocdn.com/video/466215845_100x75.jpg","ruTranscript":"Первая новость: никакой армии на территории нет.","ruDescription":"Отряды пехоты, которые действительно воюют в данный момент, в отличие от войск, не принимающих участия либо находящихся в состоянии переброски на участок конфликта или военных действий."},{"vimeoId":"87408554","title":"bottom line","description":"The words \"bottom line\" originally were used in accounting indicating the total balance. Now a variety of uses:  the result or statement; the main point; the outcome of a process, discussion, etc and even the curves around a girl's butt.","transcript":"Bottom line,Tom: I cut expenses 12%.","imgSrc":"http://i.vimeocdn.com/video/465454499_100x75.jpg","ruTranscript":"В итоге, Том, я снизил расходы на 12%.","ruDescription":"Произошло от линии, под которой пишут результат при арифметических подсчетах. Теперь идиома обладает рядом значений: результат или утверждение; основная мысль высказывания; исход процесса или беседы или даже очертания женской попы."},{"vimeoId":"87408521","title":"bottom line","description":"The words \"bottom line\" originally were used in accounting indicating the total balance. Now a variety of uses:  the result or statement; the main point; the outcome of a process, discussion, etc and even the curves around a girl's butt.","transcript":"Bottom line: president of the United States would not want to put his own prestige and that of the United States on the line by calling world leaders.","imgSrc":"http://i.vimeocdn.com/video/465454404_100x75.jpg","ruTranscript":"Итог таков: президент США не захочет ставить под удар престижное положение страны и самого себя, пытаясь связаться с мировыми лидерами.","ruDescription":"Произошло от линии, под которой пишут результат при арифметических подсчетах. Теперь идиома обладает рядом значений: результат или утверждение; основная мысль высказывания; исход процесса или беседы или даже очертания женской попы."},{"vimeoId":"87408538","title":"bottom line","description":"The words \"bottom line\" originally were used in accounting indicating the total balance. Now a variety of uses:  the result or statement; the main point; the outcome of a process, discussion, etc and even the curves around a girl's butt.","transcript":"But the question remains: will the cruise ship industry put your safety before their bottom line?","imgSrc":"http://i.vimeocdn.com/video/465454416_100x75.jpg","ruTranscript":"Но вопрос так и не решен: сделают ли производители круизных судов безопасность пассажиров своим приоритетом?","ruDescription":"Произошло от линии, под которой пишут результат при арифметических подсчетах. Теперь идиома обладает рядом значений: результат или утверждение; основная мысль высказывания; исход процесса или беседы или даже очертания женской попы."},{"vimeoId":"87408573","title":"bottom line","description":"The words \"bottom line\" originally were used in accounting indicating the total balance. Now a variety of uses:  the result or statement; the main point; the outcome of a process, discussion, etc and even the curves around a girl's butt.","transcript":"A month ago they were overturning and smashing Japanese cars on the streets of Chinese cities. Now the fallout from those anti-Japanese protests is starting to hit the bottom line of the Japan's car companies.","imgSrc":"http://i.vimeocdn.com/video/465454519_100x75.jpg","ruTranscript":"Месяц назад в городах Китая переворачивали и разбивали японские машины. Теперь последствия этих анти-японских акций протеста начинают бить по кошелькам японских производителей автомобилей.","ruDescription":"Произошло от линии, под которой пишут результат при арифметических подсчетах. Теперь идиома обладает рядом значений: результат или утверждение; основная мысль высказывания; исход процесса или беседы или даже очертания женской попы."},{"vimeoId":"87408616","title":"bottom line","description":"The words \"bottom line\" originally were used in accounting indicating the total balance. Now a variety of uses:  the result or statement; the main point; the outcome of a process, discussion, etc and even the curves around a girl's butt.","transcript":"Governor Romney, Governor Romney looks at the notion of equal pay in terms of the companies bottom line.","imgSrc":"http://i.vimeocdn.com/video/465454577_100x75.jpg","ruTranscript":"А губернатор Ромни, губернатор Ромни смотрит на концепцию равных зарплат в контексте доходов компаний.","ruDescription":"Произошло от линии, под которой пишут результат при арифметических подсчетах. Теперь идиома обладает рядом значений: результат или утверждение; основная мысль высказывания; исход процесса или беседы или даже очертания женской попы."},{"vimeoId":"87408586","title":"bottom line","description":"The words \"bottom line\" originally were used in accounting indicating the total balance. Now a variety of uses:  the result or statement; the main point; the outcome of a process, discussion, etc and even the curves around a girl's butt.","transcript":"Bottom line: unless I ring my bell, you stay out of Heaven (angels talking).","imgSrc":"http://i.vimeocdn.com/video/465454518_100x75.jpg","ruTranscript":"В итоге вот что: пока я не позвоню в колокол, ты держишься от рая подальше (беседа ангелов).","ruDescription":"Произошло от линии, под которой пишут результат при арифметических подсчетах. Теперь идиома обладает рядом значений: результат или утверждение; основная мысль высказывания; исход процесса или беседы или даже очертания женской попы."},{"vimeoId":"87408598","title":"bottom line","description":"The words \"bottom line\" originally were used in accounting indicating the total balance. Now a variety of uses:  the result or statement; the main point; the outcome of a process, discussion, etc and even the curves around a girl's butt.","transcript":"Bottom line: talks continue.","imgSrc":"http://i.vimeocdn.com/video/465454567_100x75.jpg","ruTranscript":"Итог: переговоры продолжаются.","ruDescription":"Произошло от линии, под которой пишут результат при арифметических подсчетах. Теперь идиома обладает рядом значений: результат или утверждение; основная мысль высказывания; исход процесса или беседы или даже очертания женской попы."},{"vimeoId":"87408674","title":"brain drain","description":"The loss of skilled intellectual and technical labor through the movement of such labor to more favorable geographic, economic, or professional environments.","transcript":"Europe's job crisis triggers a brain drain for struggling economies...","imgSrc":"http://i.vimeocdn.com/video/465454661_100x75.jpg","ruTranscript":"Безработица в Европе провоцирует утечку кадров в странах с нестабильной экономикой…","ruDescription":"Утечка кадров в сфере науки и техники в более благоприятные для них географические, экономические или профессиональный условия."},{"vimeoId":"87408659","title":"brain drain","description":"The loss of skilled intellectual and technical labor through the movement of such labor to more favorable geographic, economic, or professional environments.","transcript":"And that brain drain continues to this day. In Akademgorodok cafe I met one of hundreds of science graduates still leaving the city every year.","imgSrc":"http://i.vimeocdn.com/video/465454639_100x75.jpg","ruTranscript":"Вся эта утечка кадров происходит и по сей день. В одном из кафе Академгородка я встретил одного из сотен начинающих ученых, которые каждый год покидают город.","ruDescription":"Утечка кадров в сфере науки и техники в более благоприятные для них географические, экономические или профессиональный условия."},{"vimeoId":"87408643","title":"brain drain","description":"The loss of skilled intellectual and technical labor through the movement of such labor to more favorable geographic, economic, or professional environments.","transcript":"The concern in parts of Southern Europe is of a brain drain depriving countries of their most qualified workers.","imgSrc":"http://i.vimeocdn.com/video/465454585_100x75.jpg","ruTranscript":"В некоторых странах Южной Европы возрастает беспокойство в связи с утечкой кадров, которая лишает эти государства наиболее квалифицированных работников.","ruDescription":"Утечка кадров в сфере науки и техники в более благоприятные для них географические, экономические или профессиональный условия."},{"vimeoId":"86836459","title":"brush with something","description":"To “have a brush with something” is to have a brief contact, to have an experience with something (especially with the law).","transcript":"My own family, Mr Speaker, endured a brush with this violence.","imgSrc":"http://i.vimeocdn.com/video/464657969_100x75.jpg","ruTranscript":"Это насилие коснулось моей собственной семьи, господин спикер.","ruDescription":"Иметь связь, опыт обращения с чем-либо (особенно с тем или иным законом)."},{"vimeoId":"88520908","title":"budgie smugglers","description":"\"Budgie smugglers\" - Australian slang term for men's tight-fitting Speedo-style swimwear. The 'lump in the front' apparently resembles a budgie when it is stuffed down the front of someone's shorts.","transcript":"And today the 55-year old is still considered a fitness fanatic well known for his famous trunks  what Australians like to call 'budgie smugglers'.","imgSrc":"http://i.vimeocdn.com/video/467009232_100x75.jpg","ruTranscript":"И этот 55-летний мужчина все еще считается ярым поклонником фитнеса и известен своими трусами, которые австралийцы предпочитают называть \"контрабандистами попугаев\".","ruDescription":"Выражение австралийского сленга об обтягивающих мужских купальных плавках. Гениталии в таких напоминают волнистого попугая (budgie), которого запихнули в шорты, чтобы вывезти из страны."},{"vimeoId":"88092181","title":"Butterflies in one's stomach","description":"\"Butterflies in one's stomach\" can be caused by nervousness and fear of the unknown. \"Butterflies in the stomach\" are often seen as a positive and harmless sign of subconscious feelings caused by the release of mood-altering endorphins.","transcript":"Butterflies? Always! I don't sleep the night before. It's like the first day of school.","imgSrc":"http://i.vimeocdn.com/video/466408347_100x75.jpg","ruTranscript":"Бабочки в животе? Каждый раз! Я не сплю в последнюю ночь. Это как первый раз пойти в школу.","ruDescription":"Ощущение при нервозности или страхе неизвестности. Это явление часто рассматривается в положительном свете как безвредный знак подсознательных ощущений по причине выброса эндорфинов, влияющих на настроение."},{"vimeoId":"88520933","title":"charm offensive","description":"\"Charm offensive\": a series of actions intended to get people to like and trust you so that you can influence them.","transcript":"Vladimir Putin and the Russians just spent fifty billion dollars on the Sochi charm offensive to try to redefine Russia in the 21st century. That Sochi charm offensive died on the streets of Sevastopol.","imgSrc":"http://i.vimeocdn.com/video/467009279_100x75.jpg","ruTranscript":"Россия с Владимиром Путиным во главе недавно потратила 50 миллиардов долларов на сочинское умасливание всего мира в попытке изменить положение России в 21 веке. Эта попытка умерла на улицах Севастополя.","ruDescription":"Серия действий, направленных на то, чтобы понравиться и завоевать доверие людей для того, чтобы иметь на них влияние."},{"vimeoId":"88520948","title":"charm offensive","description":"\"Charm offensive\": a series of actions intended to get people to like and trust you so that you can influence them.","transcript":"Well, that charm offensive by Iran's new President to one side. It was not that long ago that his predecessor called for its destruction.","imgSrc":"http://i.vimeocdn.com/video/467009294_100x75.jpg","ruTranscript":"Ну, с одной стороны это попытка нового президента Ирана всех умаслить. Не так давно его предшественник призывал все это уничтожить.","ruDescription":"Серия действий, направленных на то, чтобы понравиться и завоевать доверие людей для того, чтобы иметь на них влияние."},{"vimeoId":"88520915","title":"charm offensive","description":"\"Charm offensive\": a series of actions intended to get people to like and trust you so that you can influence them.","transcript":"It's all part of Iran's charm offensive.","imgSrc":"http://i.vimeocdn.com/video/467009269_100x75.jpg","ruTranscript":"Все это - часть попытки Ирана умаслить всех.","ruDescription":"Серия действий, направленных на то, чтобы понравиться и завоевать доверие людей для того, чтобы иметь на них влияние."},{"vimeoId":"88092599","title":"clarion call","description":"\"A clarion call\" is a strong and clear request for people to do something (often + for).","transcript":"Further integration and sharing of sovereignty! A clarion call towards a federal states of Europe.","imgSrc":"http://i.vimeocdn.com/video/466408908_100x75.jpg","ruTranscript":"\"Дальнейшая интеграция и разделение суверенитета!\" - гласит призыв к федеративным государствам Европы.","ruDescription":"Эмоциональный и ясный призыв к людям сделать что-либо."},{"vimeoId":"88520953","title":"clear-cut","description":"\"Clear-cut\" = clear and certain, so that there is no doubt about something.","transcript":"And until we get some clear-cut message where this economy's going...","imgSrc":"http://i.vimeocdn.com/video/467009297_100x75.jpg","ruTranscript":"И пока мы не получим четких сведений о том, в какую сторону движется экономика этой страны…","ruDescription":"Ясный и точный, в котором не приходиться сомневаться"},{"vimeoId":"87951094","title":"close call","description":"A \"close call\" is something bad that almost happened. Please find information about \"thick of things\" in our library.","transcript":"21-year old volunteer medic Olesya Zhukovska was in the thick of things providing first aid, when she was struck by a bullet.It was a close call but Olesya was lucky.","imgSrc":"http://i.vimeocdn.com/video/466215872_100x75.jpg","ruTranscript":"21-летняя врач-волонтер Олеся Жуковска активно оказывала первую помощь, когда в нее выстрелили. Ранение было очень опасным, но Олесе повезло.","ruDescription":"Что--то плохое, что едва не случилось. Пожалуйста, ознакомьтесь с идиомой \"thick of things\" в нашей коллекции."},{"vimeoId":"88092620","title":"cold case","description":"A \"cold case\" is an investigation that has had no new developments for a long period of time.","transcript":"Any cold case involving Michael Jackson always generates a huge amount of public interest.","imgSrc":"http://i.vimeocdn.com/video/466408954_100x75.jpg","ruTranscript":"Любое расследование без доказательств в отношении Майкла Джексона всегда привлекает огромное внимание общественности.","ruDescription":"Расследование, в котором нет продвижений в течение долгого времени."},{"vimeoId":"88092644","title":"cold case","description":"A \"cold case\" is an investigation that has had no new developments for a long period of time.","transcript":"The words \"cold case\" are on the screen only (not pronounced).","imgSrc":"http://i.vimeocdn.com/video/466408975_100x75.jpg","ruTranscript":"Идиома на экране (без звукового сопровождения).","ruDescription":"Расследование, в котором нет продвижений в течение долгого времени."},{"vimeoId":"88092694","title":"cold comfort","description":"\"Cold comfort\" is a negligible comfort or consolation, Extremely limited empathy, sympathy, or encouragement.","transcript":"\"The big chill looks to be over in the US but there could be a lot of new problems coming down the pipe caused by melting ice\". You can see the words \"cold comfort\" on the screen only. Please find info about the meaning of \"pipe\" in our library.","imgSrc":"http://i.vimeocdn.com/video/466409104_100x75.jpg","ruTranscript":"\"Кажется, сильные заморозки в США закончились, но теперь могут появиться новые проблемы в связи с таянием льда.\" Идиома отображена только на экране. Пожалуйста, ознакомьтесь со значением слова \"pipe\" в нашей коллекции.","ruDescription":"Незначительное утешение, очень слабая поддержка, сопереживание."},{"vimeoId":"88092681","title":"cold comfort","description":"\"Cold comfort\" is a negligible comfort or consolation, Extremely limited empathy, sympathy, or encouragement.","transcript":"And did they get you to trade your heroes for ghosts,hot ashes for trees, hot air for a cool breeze? Cold comfort for change?","imgSrc":"http://i.vimeocdn.com/video/466408981_100x75.jpg","ruTranscript":"Они заставили вас променять своих героев на призраков, горячий пепел на деревья, раскаленный воздух на прохладный бриз? Ничтожные компенсации на перемены?","ruDescription":"Незначительное утешение, очень слабая поддержка, сопереживание."},{"vimeoId":"87408742","title":"cook the books","description":"To \"cook the books\" means to keep false financial records for an organization often with the aim of avoiding the payment of tax.","transcript":"We know that people cooked the books at Fannie Mae and Freddie Mac.","imgSrc":"http://i.vimeocdn.com/video/465454712_100x75.jpg","ruTranscript":"Мы знаем, что сотрудники Fannie Mae и Freddie Mac вели черную бухгалтерию.","ruDescription":"Вести ложную финансовую документацию организации, чаще всего с целью избежать уплаты налогов."},{"vimeoId":"87408725","title":"cook the books","description":"To \"cook the books\" means to keep false financial records for an organization often with the aim of avoiding the payment of tax.","transcript":"The company's chairman resigned on Wednesday after revealing the news that he cooked the books.","imgSrc":"http://i.vimeocdn.com/video/465454706_100x75.jpg","ruTranscript":"Генеральный директор компании освободил свой пост после того, как была раскрыта информация о его черной бухгалтерии.","ruDescription":"Вести ложную финансовую документацию организации, чаще всего с целью избежать уплаты налогов."},{"vimeoId":"88092706","title":"crazy like a fox","description":"\"Crazy like a fox\" implies the opposite: the individual refered to is not crazy at all, rather cunning (like a fox).  Used when one appears to be 'crazy', but is acting with a hidden motive.","transcript":"Now, he's crazy like a fox in that respect:people are thinking he's ruining his career. Crazy! He's helping his career!","imgSrc":"http://i.vimeocdn.com/video/466409127_100x75.jpg","ruTranscript":"А теперь люди думают, что этот хитрец рушит свою карьеру. Рушит! Он строит ее!","ruDescription":"Хитрый, как лис. Используется, когда кто-либо ведет себя неадекватно, имея для этого скрытые мотивы."},{"vimeoId":"87951101","title":"cream of the crop","description":"\"cream of the crop\" is the best of all.","transcript":"The cream...yeah...the cream of the crop!","imgSrc":"http://i.vimeocdn.com/video/466215877_100x75.jpg","ruTranscript":"Самое… Да… Самое лучшее!","ruDescription":"Самое лучшее."},{"vimeoId":"89498169","title":"crush on","description":"To have a feeling of romantic love for someone, especially someone you do not know well.","transcript":"I've got a crash on you.","imgSrc":"http://i.vimeocdn.com/video/468270277_100x75.jpg","ruTranscript":"Я на тебя запал.","ruDescription":"Испытывать к кому-либо романтические чувства, особенно к человеку, которого толком не знаешь."},{"vimeoId":"88092724","title":"cry foul","description":"\"Cry foul\": to say that something which has happened is unfair or illegal.","transcript":"Well, very wealthy Russians are joining the Cypriots in crying foul about the attacks on savings. That's because Russians have an estimated 30 billion dollars in Cypriot banks.","imgSrc":"http://i.vimeocdn.com/video/466409156_100x75.jpg","ruTranscript":"Многие богатые россияне, так же как и киприоты, недовольны нападками на деньги в банках. Это связано с тем, что в банках Кипра хранится примерно 30 миллиардов российских долларов.","ruDescription":"Утверждать, что произошедшее нечестно или нелегально."},{"vimeoId":"93053102","title":"crying shame","description":"\"Crying shame\": a very unfortunate situation; a real shame. ","transcript":"Because they've waited three days to file any charges against someone who is responsible for four dead babies.  It is a crying shame and I`m getting to the bottom of it. Dead babies deserve justice.","imgSrc":"http://i.vimeocdn.com/video/472988536_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86387222","title":"cut above","description":"cut above something - a measure or degree better than something else.","transcript":"… a cut above the rest of us. (about police officers killed while protecting the members of Congress).","imgSrc":"http://i.vimeocdn.com/video/464039227_100x75.jpg","ruTranscript":"…намного лучше нас (об офицерах полиции, которые погибли, защищая членов Конгресса).","ruDescription":"На порядок лучше чего-либо."},{"vimeoId":"88092799","title":"cutting edge","description":"\"Cutting edge\": something that is particularly advanced or brand new in terms of innovation.","transcript":"...some of the country's best scientific minds are involved in developing cutting edge intelligent robots.","imgSrc":"http://i.vimeocdn.com/video/466409224_100x75.jpg","ruTranscript":"…одни из выдающихся ученых страны участвуют в разработке инновационных роботов с искуственным интеллектом.","ruDescription":"Что-то очень продвинутое или инновационное."},{"vimeoId":"88092818","title":"cutting edge","description":"\"Cutting edge\": something that is particularly advanced or brand new in terms of innovation.","transcript":"The cutting edge of stem cell science.","imgSrc":"http://i.vimeocdn.com/video/466409249_100x75.jpg","ruTranscript":"Открытие в изучении стволовых клеток.","ruDescription":"Что-то очень продвинутое или инновационное."},{"vimeoId":"88092776","title":"cutting edge","description":"\"Cutting edge\": something that is particularly advanced or brand new in terms of innovation.","transcript":"So what they've done is take an old master,  and they've taken that painting from the past and they brought it to life in the future by using cutting-edge digital technology.\"","imgSrc":"http://i.vimeocdn.com/video/466409205_100x75.jpg","ruTranscript":"Они сделали следующее: взяли старый шедевр из прошлого и вернули его к жизни в будущем, используя новейшие цифровые технологии.","ruDescription":"Что-то очень продвинутое или инновационное."},{"vimeoId":"88092749","title":"cutting edge","description":"\"Cutting edge\": something that is particularly advanced or brand new in terms of innovation.","transcript":"It's a gadget lovers paradise and the cutting edge of music, design and technology.","imgSrc":"http://i.vimeocdn.com/video/466409161_100x75.jpg","ruTranscript":"Это рай для любителя гаджетов и последнее слово с точки зрения музыки, дизайна и технологий.","ruDescription":"Что-то очень продвинутое или инновационное."},{"vimeoId":"88092852","title":"cutting edge","description":"\"Cutting edge\": something that is particularly advanced or brand new in terms of innovation.","transcript":"Snipers' weapons are always at the cutting edge of this technology.","imgSrc":"http://i.vimeocdn.com/video/466409244_100x75.jpg","ruTranscript":"Снайперское оружие всегда оснащено по последнему слову этой технологии.","ruDescription":"Что-то очень продвинутое или инновационное."},{"vimeoId":"88092887","title":"dead set against something","description":"To be \"dead set against something\" is to be completely opposed to something.","transcript":"Israel and much of the Arab world are dead set against the nuclear deal.","imgSrc":"http://i.vimeocdn.com/video/466409385_100x75.jpg","ruTranscript":"Израиль и большая часть арабских стран категорически против соглашения по ядерным вооружениям.","ruDescription":"Быть категорически против чего-либо."},{"vimeoId":"95782246","title":"deadly earnest","description":"\"Deadly earnest\": very sincere and earnest but suggests that the topic may easily be a matter of life or death.","transcript":"But the biggest war game to be held here in 20 years is in deadly earnest.","imgSrc":"http://i.vimeocdn.com/video/475765453_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88092915","title":"DOA","description":"DOA is a police term: \"dead on arrival\"","transcript":"It's amazing how you go from being DOA to being a genius in about three weeks.","imgSrc":"http://b.vimeocdn.com/ts/466/409/466409411_100.jpg","ruTranscript":"Это невероятно: сначала ты объявлен погибшим, а через три недели все говорят, что ты гений.","ruDescription":"Полицейский термин: \"смерть при поступлении (в больницу)\""},{"vimeoId":"86836486","title":"doldrums","description":"“Doldrums” is a state or period in which there is no activity or improvement (derived from historical maritime , in which it refers to those parts of the oceans where the winds are calm).","transcript":"The people of Iran are hoping that their nation’s natural resources, when finally unleashed will help them out of their economic doldrums too.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658004_100.jpg","ruTranscript":"Иранцы надеются, что когда природные ресурсы страны будут в большей степени освоены, они смогут преодолеть экономический застой.","ruDescription":"Состояние либо период времени без активности или улучшения (заимствовано из судоходного дела, где это выражение означает участки океана с тихими ветрами)."},{"vimeoId":"87408752","title":"drop the ball","description":"To \"drop the ball\" is to make an error; miss an opportunity; fail.","transcript":"- Exterminate! - Looks like you dropped the ball.","imgSrc":"http://i.vimeocdn.com/video/465454798_100x75.jpg","ruTranscript":"- Истребить! - Похоже, ты совершил ошибку.","ruDescription":"Сделать ошибку; упустить возможность; провалиться."},{"vimeoId":"86836501","title":"end of the tunnel","description":"Two idioms mixed: “silver lining” and “light at the end of the tunnel” which means the end of a difficult period or job. Please find more about the first part in our library.","transcript":"You know you see a silver lining at the end of the tunnel.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658072_100.jpg","ruTranscript":"Вы знаете, в конце туннеля всегда видишь что-то хорошее.","ruDescription":"В примере задействованы две идиомы: \"silver lining\" и \"light at the end of the tunnel\". Конец тяжелого периода или работы. Пожалуйста, ознакомьтесь с первой идиомой в нашей коллекции."},{"vimeoId":"93053019","title":"every mother's son","description":" Every mother's son: every one of them.","transcript":"Two faced woman with the two faced lies. I hope your two faced living made you satisfied. Tell me baby. I was your only one. While you've been running around town with every mother's son.","imgSrc":"http://i.vimeocdn.com/video/472988426_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053026","title":"every trick in the book","description":"\"Every trick in the book\": every known to you way to achieve your goal.","transcript":"We use every trick in the book to master the art of seduction.","imgSrc":"http://i.vimeocdn.com/video/472988427_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89498088","title":"eye broccoli","description":"Someone or something that is visually unattractive or hurtful to look at. Antonym of Eye Candy.","transcript":"- So, who's the eye broccoli? - Hey, that's Iris, my new assistant. And yes, she is a little plain, but I'm married, so that's good.","imgSrc":"http://b.vimeocdn.com/ts/468/270/468270132_100.jpg","ruTranscript":"- Ну, что это за страхолюдина? - Это Ирис, моя новая помощница. И да, она не очень, но я женат, поэтому это хорошо.","ruDescription":"Кто-то или что-то, на что неприятно или больно смотреть. Антоним идиомы \"eye candy\"."},{"vimeoId":"95782272","title":"fait accompli","description":"\"Fait accompli\": an accomplished fact; something already done.","transcript":"I'm not sure that the elections are already decided, I'm not sure even Mr. Netanyahu's victory is a fait accompli.","imgSrc":"http://i.vimeocdn.com/video/475765469_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782302","title":"fait accompli","description":"\"Fait accompli\": an accomplished fact; something already done.","transcript":"And is it now a fait accompli that on Monday we will see sanctions from the European Union and the United States?","imgSrc":"http://i.vimeocdn.com/video/475765604_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87408798","title":"fallback","description":"to move back from something; to retreat from something.","transcript":"So, until next time. The usual arrangements, the usual fallback.","imgSrc":"http://b.vimeocdn.com/ts/465/454/465454817_100.jpg","ruTranscript":"Ну что, до следующего раза. В то же время, в том же месте, тот же запасной план.","ruDescription":"Сделать шаг назад; отступить от чего-то."},{"vimeoId":"87408770","title":"fallback","description":"to move back from something; to retreat from something.","transcript":"You know, Mr.Holland, I don't think of teaching as a fallback position and I grow nervous around  people who do.","imgSrc":"http://b.vimeocdn.com/ts/465/454/465454810_100.jpg","ruTranscript":"Знаете, господин Холланд, я не расцениваю преподавание как запасной вариант, и нервничаю, когда вижу тех, кто относится к нему так.","ruDescription":"Сделать шаг назад; отступить от чего-то."},{"vimeoId":"87408833","title":"family jewels","description":"\"family jewels\" - a male's testicles (slang); please read and watch about \"lock and key\" in our library","transcript":"Oh he was nude in his own hotel room.That shoul be OK!You do have to be careful  of the family jewels though when you are royalty. I'm just saying you have to  keep those under lock and key.","imgSrc":"http://b.vimeocdn.com/ts/465/454/465454873_100.jpg","ruTranscript":"Он сидел голым в своем номере в гостинице. Это нормально, но нужно быть осторожным со своим хозяйством, если ты член королевской семьи. Я хочу сказать, нужно хранить их за семью замками.","ruDescription":"Мужские яички (сленг); пожалуйста, ознакомьтесь со значением идиомы \"lock and key\" в нашей библиотеке."},{"vimeoId":"89498118","title":"far and wide","description":"\"Far and wide\": across a large area, many places","transcript":"In 1996 TWA800 flight exploded in the sky near New York. Debris scattered far and wide.","imgSrc":"http://b.vimeocdn.com/ts/468/270/468270136_100.jpg","ruTranscript":"В 1996 самолет, следующий рейсом TWA800, взорвался недалеко от Нью-Йорка. Обломки разнесло на большое расстояниее.","ruDescription":"На большой территории, во многих местах."},{"vimeoId":"93053034","title":"far cry","description":"\"Far cry\": a long way.","transcript":"it's a far cry from Schwarznegger's triumphant election just over two years ago.","imgSrc":"http://i.vimeocdn.com/video/472988437_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053051","title":"far cry","description":"\"Far cry\": a long way.","transcript":"That's a far cry from the openness and transparency that my Republican friends promised.","imgSrc":"http://i.vimeocdn.com/video/472988455_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782339","title":"final nail in the coffin","description":"\"Final nail in the coffin\": an event which causes the failure of something that had already started to fail.","transcript":"A new alliance between former Palestinian foes could prove to be the final nail in the coffin for the Middle-East peace process.","imgSrc":"http://i.vimeocdn.com/video/475765615_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88520580","title":"for good","description":"\"For good\": forever; permanently.","transcript":"By providing rent and the deposit Bruno now helps families leave the motel life behind for good.","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008823_100.jpg","ruTranscript":"Помогая с оплатой и задатком за квартиры, Бруно помогает семьям забыть о жизни в мотелях.","ruDescription":"Навсегда."},{"vimeoId":"88520571","title":"for good","description":"\"For good\": forever; permanently.","transcript":"You'll be the hero of the neighborhood, nobody knows that you left for good.","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008813_100.jpg","ruTranscript":"Ты будешь героем всего района, никто не знает, что ты уехал навсегда.","ruDescription":"Навсегда."},{"vimeoId":"88520591","title":"for good","description":"\"For good\": forever; permanently.","transcript":"To stop for good the war.","imgSrc":"http://i.vimeocdn.com/video/467008829_100x75.jpg","ruTranscript":"Остановить войну навсегда.","ruDescription":"Навсегда."},{"vimeoId":"88091541","title":"friendly fire","description":"\"Friendly fire\" is a discharge of a military weapon that injures or kills a member of one's own armed forces or an ally.","transcript":"...video of the deadly incident of American friendly fire on British forces in Iraq... British convoy was mistakenly attacked in 2003.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407329_100.jpg","ruTranscript":"…видеосюжет о несчастном случае, когда в Ираке американские солдаты открыли огонь по своим - британцам… Британский конвой был по ошибке атакован в 2003 году.","ruDescription":"Стрелять в солдата своей же армии или союзника."},{"vimeoId":"88520619","title":"from scratch","description":"If you do something from scratch, you start right at the beginning, from nothing.","transcript":"If you are designing a megacity from scratch...","imgSrc":"http://i.vimeocdn.com/video/467008887_100x75.jpg","ruTranscript":"Если вы проектируете мегаполис с нуля…","ruDescription":"С нуля."},{"vimeoId":"88520625","title":"from scratch","description":"If you do something from scratch, you start right at the beginning, from nothing.","transcript":"Rebuilds from scratch.","imgSrc":"http://i.vimeocdn.com/video/467008883_100x75.jpg","ruTranscript":"Строится с нуля.","ruDescription":"С нуля."},{"vimeoId":"88520611","title":"from scratch","description":"If you do something from scratch, you start right at the beginning, from nothing.","transcript":"When weather changed history, a town wiped off from a map rebuilds from scratch.","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008884_100.jpg","ruTranscript":"Когда погода переписала историю, город, стертый с лица Земли, строится заново.","ruDescription":"С нуля."},{"vimeoId":"88520602","title":"from scratch","description":"If you do something from scratch, you start right at the beginning, from nothing.","transcript":"The existing structure was old, outdated,the metal was corroded, meaning engineers have to find the way to build it from scratch.","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008830_100.jpg","ruTranscript":"Существующая конструкция была старой, ржавой, то есть инженерам нужно придумать, как построить ее с нуля.","ruDescription":"С нуля."},{"vimeoId":"88520632","title":"from scratch","description":"If you do something from scratch, you start right at the beginning, from nothing.","transcript":"...who had been a medic dealing with the most extreme circumstances. When he came home and he wanted become a nurse he had to start from scratch!","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008882_100.jpg","ruTranscript":"…который был врачом, работающим в экстремальных условиях.  Когда он приехал домой и решил стать санитаром, ему пришлось начинать с нуля!","ruDescription":"С нуля."},{"vimeoId":"89511011","title":"from the horse's mouth","description":"\"From the horse's mouth\": if you get information about something from the horse's mouth,  you get it from someone who is involved in it and knows a lot about it. Please find info about \"to hear something on the grapevine\" in our library.","transcript":"I heard it on the grapevine, straight from the horse's mouth. They're saying on the grapevine that he's heading north and you're going south.","imgSrc":"http://b.vimeocdn.com/ts/468/286/468286556_100.jpg","ruTranscript":"Я слышала от тех, кому поведали те, кто знает точно. Говорят, что он держит путь север, а ты идешь на юг.","ruDescription":"От знающего человека, из достоверного источника (о сведениях)."},{"vimeoId":"88091564","title":"front burner","description":"\"Front burner\": a condition or position of top priority;  getting or needing immediate attention","transcript":"The world has changed. Well, the world has changed yet again: from Egypt to Tunisia and now Libya,  which has put international affairs back on the front burner.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407474_100.jpg","ruTranscript":"Мир изменился. Изменился снова: из Египта в Тунис и теперь в Ливию, которая снова сделала иностранные дела приоритным направлением.","ruDescription":"Первостепенный; получающий или требующий немедленного внимания."},{"vimeoId":"88091582","title":"front burner","description":"\"Front burner\": a condition or position of top priority;  getting or needing immediate attention","transcript":"We heard Rick Santorum talk about the abortion issue. Look, this cannot be our front burner issue.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407467_100.jpg","ruTranscript":"Мы слышали, как Рик Санторум говорил о проблеме абортов. Поймите, это не может быть нашей первостепенной проблемой.","ruDescription":"Первостепенный; получающий или требующий немедленного внимания."},{"vimeoId":"88520646","title":"full steam","description":"\"Full steam ahead\": with all possible energy and enthusiasm.","transcript":"Meantime diplomatic manoeuvres are going full steam.","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008892_100.jpg","ruTranscript":"В это время дипломатические процессы идут полным ходом.","ruDescription":"Со всеми силами и энтузиазмом."},{"vimeoId":"95782371","title":"glaringly obvious","description":"\"Glaringly obvious\": really obvious, it describes that the thing (metaphorically) glares at you. It's a sight-based metaphor.","transcript":"The need for investment in Cuba is glaringly obvious on every street but modernizing this economy is a giant task.","imgSrc":"http://i.vimeocdn.com/video/475765727_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782404","title":"glimmer of hope","description":"\"Glimmer of hope\": a slight chance that something positive will happen.","transcript":"…from that meeting in Geneva when there was a glimmer of hope that the diplomatic solution could be found to the crisis in Ukraine.","imgSrc":"http://i.vimeocdn.com/video/475765664_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782439","title":"growing pains","description":"\"Growing pains\": problems that arise in the initiation or enlargement of an enterprise; a pain you feel while growing rapidly.","transcript":"It is a one-party state, they saw it as a one-party state, they didn't see anything wrong with that. And that is where the growing pains are going on in South Africa now.","imgSrc":"http://i.vimeocdn.com/video/475765744_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86836538","title":"guinea pig","description":"If someone is used as a guinea pig, new ideas or products are tested on them","transcript":"Graduate student George is today's guinea pig.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658092_100.jpg","ruTranscript":"Сегодня нашим подопытным будет аспирант Джордж.","ruDescription":"Тот, на ком проверяются новые идеи или продукты."},{"vimeoId":"86836531","title":"guinea pig","description":"If someone is used as a guinea pig, new ideas or products are tested on them","transcript":"Patients who volunteer for clinical trials are nothing more than guinea pigs.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658095_100.jpg","ruTranscript":"Пациенты, добровольно участвующие в клинических испытаниях, всего лишь подопытные кролики.","ruDescription":"Тот, на ком проверяются новые идеи или продукты."},{"vimeoId":"88091616","title":"gusto","description":"\"Gusto\" is an enthusiastic and vigorous enjoyment or appreciation.","transcript":"'Is it a reluctant role that you've had to take on? Or do you take it on now with such pride and gusto of being an advocate of change for the gay community here in Hong Kong?'","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407553_100.jpg","ruTranscript":"\"Была ли это вынужденная роль? Или вы сейчас относитесь к вашему положению защитника и инициатора изменений положения геев в Гонконге с гордостью и удовольствием?\"","ruDescription":"Удовольствие, смак."},{"vimeoId":"89277013","title":"gut feeling","description":"\"Gut feeling\":a personal, intuitive feeling.","transcript":"- All right. Enough polls! I want your gut feeling.  - Well, I think, Romney will win. - My gut feeling is that Obama's gonna win by 1%.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957776_100.jpg","ruTranscript":"- Ладно, хватит опросов! Я хочу, чтобы вы сказали, что вы предчувствуете. - Ну, я думаю, победит Ромни. - Моя интуиция подсказывает, что Обама победит с разницей в 1%.","ruDescription":"Интуиция."},{"vimeoId":"95782468","title":"gut feeling","description":"\"Gut feeling\": a personal, intuitive feeling.","transcript":"So from your experience what's your gut feeling? My gut feeling is that he is going to beat…","imgSrc":"http://i.vimeocdn.com/video/475765782_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782496","title":"half-mast","description":"\"Half-mast\": a position some distance below the top of a mast to which a flag is lowered in mourning or to signal distress.","transcript":"In dawning streets today the flag is flying at half-mast in honor the one of the most remarkable women in politics.","imgSrc":"http://i.vimeocdn.com/video/475765790_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87408917","title":"hand-to-mouth","description":"\"Hand-to-mouth\": having or providing only the bare essentials; with barely enough money or food to satisfy immediate needs.","transcript":"And, you know, he's displaced, as many others are, and kinda living hand to mouth.","imgSrc":"http://b.vimeocdn.com/ts/465/454/465454988_100.jpg","ruTranscript":"И знаете, он находится не на своем месте, как и многие другие, и ему едва хватает на жизнь.","ruDescription":"Иметь лишь необходимое; едва иметь достаточно денег или еды на удовлетворение каждодневных нужд."},{"vimeoId":"95782564","title":"here goes nothing","description":"\"Here goes nothing\": equals to something like \"here goes my best try though I'm expecting a failure. But I have nothing to lose so let's do this.\"","transcript":"All right you all, here goes nothing!","imgSrc":"http://i.vimeocdn.com/video/475765817_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87951129","title":"high and low","description":"to search \"high and low\" for something is to try very hard to find it","transcript":"I've been looking high and low for you.","imgSrc":"http://b.vimeocdn.com/ts/466/215/466215943_100.jpg","ruTranscript":"Я везде тебя ищу.","ruDescription":"Повсюду, везде."},{"vimeoId":"88520659","title":"humpty dumpty","description":"\"Humpty dumpty\": a short fat person; a person or thing that once overthrown or broken cannot be restored or mended.","transcript":"Thanks to Russias unexpected moves in Crimea, the West will now have to put Humpty Dumpty back together on its own.","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008921_100.jpg","ruTranscript":"Из-за неожиданных действий России в Крыму, Западу теперь придется самому собирать Украину по кусочкам.","ruDescription":"Низкорослый и толстый человек; человек или предмет, который невозможно восстановить при нанесении повреждения."},{"vimeoId":"95782598","title":"hustle and bustle","description":"\"Hustle and bustle\": confusion and business; busy and noisy activity.","transcript":"Take a drive to today's Mumbai. What you see isn't the clicheed India of times gone by. The cities vibrate with the unmistakebly hustle and bustle.","imgSrc":"http://i.vimeocdn.com/video/475765924_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782637","title":"icing on the cake","description":"\"The icing on the cake\": something which makes a good situation even better ","transcript":"And the icing on this social media cup cake is the chat tool so you can compare notes and live chat with other people on the website.","imgSrc":"http://i.vimeocdn.com/video/475765930_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782664","title":"icing on the cake","description":"\"The icing on the cake\": something which makes a good situation even better ","transcript":"Whether people react to it, whether it becomes popular, whether critics like it, whether audiences like it… in a sense that's the icing on the cake. It's not the cake itself. The cake is the self-exploration.","imgSrc":"http://i.vimeocdn.com/video/475766060_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782697","title":"ill-fated","description":"\"Ill-fated\": unlucky and unsuccessful, often resulting in death.","transcript":"These students are a year above the 325 schoolmates who were on the ill-fated ferry.","imgSrc":"http://i.vimeocdn.com/video/475765980_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88091661","title":"in a nut shell","description":"\"In a nutshell\" means in a few words.","transcript":"And really in a nutshell this is what it is.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407575_100.jpg","ruTranscript":"Если вкратце, то так и есть.","ruDescription":"В двух словах, вкратце."},{"vimeoId":"88091633","title":"in a nut shell","description":"\"In a nutshell\" means in a few words.","transcript":"In a nutshell, you know, it just blew up from there. It was very spectacular. (about the oil fountain).","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407556_100.jpg","ruTranscript":"Если вкратце, то он прорвался там. Было очень красиво (о фонтане нефти).","ruDescription":"В двух словах, вкратце."},{"vimeoId":"93053352","title":"in dire straits","description":"\"In dire straits\": in extreme danger or difficulty; in a desperate state.","transcript":"…starving people, and you're talking again about twenty million people in dire straits","imgSrc":"http://i.vimeocdn.com/video/472988876_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053345","title":"in dire straits","description":"\"In dire straits\": in extreme danger or difficulty; in a desperate state.","transcript":"he was an elected mayor of Moscow at a time when the capital was in dire straits","imgSrc":"http://i.vimeocdn.com/video/472988878_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053363","title":"in full swing","description":"\"In full swing\": 100% effective, at the peak of activity.","transcript":"The investigation is now in full swing.","imgSrc":"http://i.vimeocdn.com/video/472988917_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88520682","title":"in limbo","description":"Limbo is a region of the afterlife on the border of hell( religious context). Other (more often used) meanings: in a state of neglect; in an indefinite state; on hold.","transcript":"Cyprus - a country in limbo. Its banks closed...","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008939_100.jpg","ruTranscript":"Кипр - это страна в состоянии неопределенности. Ее банки закрылись…","ruDescription":"В религиозном контексте - место в загробном мире на границе с адом; более распространенное значение - в состоянии заброшенности, неопределенности; в подвешенном состоянии."},{"vimeoId":"95782730","title":"in limbo","description":"\"In limbo\": in an undefined state; on hold.","transcript":"Holding on and hoping their days of waiting in limbo will be over soon.","imgSrc":"http://i.vimeocdn.com/video/475766049_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88520673","title":"in limbo","description":"Limbo is a region of the afterlife on the border of hell( religious context). Other (more often used) meanings: in a state of neglect; in an indefinite state; on hold.","transcript":"...Snowden who is apparently still in limbo in Moscow airport...","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008929_100.jpg","ruTranscript":"…Сноуден, который очевидно находится в подвешенном состоянии в московском аэропорту…","ruDescription":"В религиозном контексте - место в загробном мире на границе с адом; более распространенное значение - в состоянии заброшенности, неопределенности; в подвешенном состоянии."},{"vimeoId":"88520711","title":"in limbo","description":"Limbo is a region of the afterlife on the border of hell( religious context). Other (more often used) meanings: in a state of neglect; in an indefinite state; on hold.","transcript":"And they've spoken to the Syrians now living in fear and also in geographic limbo.","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009003_100.jpg","ruTranscript":"Также они общались с сирийцами, живущими в страхе и географической неопределенности.","ruDescription":"В религиозном контексте - место в загробном мире на границе с адом; более распространенное значение - в состоянии заброшенности, неопределенности; в подвешенном состоянии."},{"vimeoId":"88520702","title":"in limbo","description":"Limbo is a region of the afterlife on the border of hell( religious context). Other (more often used) meanings: in a state of neglect; in an indefinite state; on hold.","transcript":"He not only runs the church here. He had to build it too.  His parishioners are a complicated lot he says - stressed in limbo full of fear.","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008995_100.jpg","ruTranscript":"Он не просто глава местной церкви, он ее построил. Он говорит, что его прихожам приходится туго - они чувствуют неопределенность и страх.","ruDescription":"В религиозном контексте - место в загробном мире на границе с адом; более распространенное значение - в состоянии заброшенности, неопределенности; в подвешенном состоянии."},{"vimeoId":"88520669","title":"in limbo","description":"Limbo is a region of the afterlife on the border of hell( religious context). Other (more often used) meanings: in a state of neglect; in an indefinite state; on hold.","transcript":"Oh... Venezuala is in consitutional limbo. So the President's supporters pray for divine intervention to save their leader.","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008922_100.jpg","ruTranscript":"Венесуэла находится в состоянии конституционной неопределенности. Поэтому сторонники президента молятся высшим силам, чтобы они вмешались и спасли их лидера.","ruDescription":"В религиозном контексте - место в загробном мире на границе с адом; более распространенное значение - в состоянии заброшенности, неопределенности; в подвешенном состоянии."},{"vimeoId":"88520693","title":"in limbo","description":"Limbo is a region of the afterlife on the border of hell( religious context). Other (more often used) meanings: in a state of neglect; in an indefinite state; on hold.","transcript":"- There is no final status solution at hand now. We are talking about interim situation.  look...- So they live in limbo? - No!","imgSrc":"http://b.vimeocdn.com/ts/467/008/467008988_100.jpg","ruTranscript":"- На данный момент окончательного решения по их статусу у нас нет, речь идет о временном положении. Судите сами… - То есть они в подвешенном состоянии? - Нет!","ruDescription":"В религиозном контексте - место в загробном мире на границе с адом; более распространенное значение - в состоянии заброшенности, неопределенности; в подвешенном состоянии."},{"vimeoId":"87951172","title":"in the pipeline","description":"\"In the pipeline\" -  in process; in a queue.In the song \"Welcome to the Machine\" the pipeline refers to the small town live performances that most artists have to play before they become famous.","transcript":"You've been in a pipeline filling in time.","imgSrc":"http://b.vimeocdn.com/ts/466/215/466215973_100.jpg","ruTranscript":"Ты давал концерты по городишкам, коротал время.","ruDescription":"В процессе; на очереди. В песне \"Welcome to the Machine\" идиома относится к концертам в маленьких городах, которые большинству артистов приходится давать прежде чем они становятся знаменитыми."},{"vimeoId":"87951154","title":"in the pipeline","description":"\"In the pipeline\" -  in process; in a queue.In the song \"Welcome to the Machine\" the pipeline refers to the small town live performances that most artists have to play before they become famous.","transcript":"Yes, there's really a Mars mission in the pipeline, and clerics here have issued  a fatwa or an official islamic ruling warning Muslims against it.","imgSrc":"http://b.vimeocdn.com/ts/466/215/466215962_100.jpg","ruTranscript":"Да, сейчас на очереди действительно полет на Марс, и местное духовенство выступило с фетвой - официальным религиозным запретом, чтобы настроить мусульман против этого.","ruDescription":"В процессе; на очереди. В песне \"Welcome to the Machine\" идиома относится к концертам в маленьких городах, которые большинству артистов приходится давать прежде чем они становятся знаменитыми."},{"vimeoId":"87951194","title":"in the thick of something","description":"\"In the thick of something\" means to be completely involved in an activity or a situation","transcript":"21-year old volunteer medic Olesya Zhukovska was in the thick of things providing first aid, when she was struck by a bullet.","imgSrc":"http://b.vimeocdn.com/ts/466/216/466216007_100.jpg","ruTranscript":"21-year old volunteer medic Olesya Zhukovska was in the thick of things providing first aid, when she was struck by a bullet.It was a close call but Olesya was lucky.","ruDescription":"Быть активно вовлеченным в деятельность или ситуацию."},{"vimeoId":"89511316","title":"in the zone","description":"\"In the zone\": expression used to describe a state of consciousness where actual skills  match the perceived performance requirements perfectly. Being in the zone implies increased focus and attention which allow  for higher levels of performance.  (\"as it were\" - sort of; as if it were true)","transcript":"- Good afternoon! - Just a moment, please. I'm in the zone as it were.","imgSrc":"http://b.vimeocdn.com/ts/468/286/468286934_100.jpg","ruTranscript":"- Доброе утро! - Подожди секунду, пожалуйста. Я, кажется, в ударе.","ruDescription":"Быть в состоянии повышенной концентрации и внимания, что позволяет показывать лучшую результативность."},{"vimeoId":"87951208","title":"itsy-bitsy","description":"itsy-bitsy - very small; tiny (This is the one and only Hungarian word that was adopted to English).","transcript":"I hate spiders, man. Just especially when you're bald, you feel them crawl on your head. But suddenly the spider became itsy-bitsy.","imgSrc":"http://b.vimeocdn.com/ts/466/216/466216011_100.jpg","ruTranscript":"Дружище, я ненавижу пауков. Особенно если ты лысый, ты чувствуешь, как они ползут по твоей голове. Но вдруг паук стал маленьким.","ruDescription":"Маленький, крохотный (единственное слово, заимствованное из венгерского)."},{"vimeoId":"95782770","title":"ivory tower","description":"\"Ivory tower\": a theoretical thing without any practical or everyday use; people out of touch with common experience, usually due to spending much of their life in academia or privileged circumstances. ","transcript":"The new American work-forces are going to have to be two things: it's going to have to be mobile, Diana, and it's going to have to be dynamic. We constantly talk about that, how do we make this not an ivory tower conversation? How does our viewer figure out how to be mobile and dynamic?","imgSrc":"http://i.vimeocdn.com/video/475766114_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89511365","title":"jaw-dropping","description":"\"Jaw-dropping\": causing great surprise or astonishment.","transcript":"watching this jaw dropping video, as this human pendulums is catapult off the 130 foot high Corona Arch in Moab Utah,  coming dangerously close to the ground.","imgSrc":"http://b.vimeocdn.com/ts/468/286/468286963_100.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782806","title":"jet set","description":"\"Jet set\": synonymous with aristocracy. Lifestyle or an international social group of wealthy people who participate in social activities all around the world that are unreachable to ordinary people who don't have private jets. ","transcript":"They were forbidden to marry: he was a senior royal and she was just a commoner. But they stayed together nevertheless. They lived a jet set life as members of European high society.","imgSrc":"http://i.vimeocdn.com/video/475766126_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89511395","title":"jigsaw puzzle","description":"\"Jigsaw puzzle\" is a puzzle consisting of a picture that has been cut up  into irregularly shaped pieces, which must be put together again to re-form the picture.","transcript":"This is why this is like a jigsaw piece that does not quite fit the puzzle.","imgSrc":"http://b.vimeocdn.com/ts/468/287/468287106_100.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86836549","title":"kernel of truth","description":"A core at the heart of a claim or narrative which also contains dubious or fictitious elements.","transcript":"…and if it has a kernel of truth that people will believe in…","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658094_100.jpg","ruTranscript":"…и если в этом есть доля правды, в которую поверят люди…","ruDescription":"Правдивая информация в высказывании, в то время как остальное - вымысел."},{"vimeoId":"95782832","title":"last bastion","description":"\"Last bastion\": the only thing or person left tat is upholding or defending an attitude, principle, etc.","transcript":"In a digital age signatures are turning into the last bastion of handwriting.","imgSrc":"http://i.vimeocdn.com/video/475766257_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053368","title":"last-ditch","description":"\"Last-ditch\": final, made in the last moment of time possible.","transcript":"The ban was supposed to come into effect in the start of January, but the owners have staged a last-ditch fight.","imgSrc":"http://i.vimeocdn.com/video/472988921_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782861","title":"last-ditch","description":"\"Last-ditch\": final, made in the last moment of time possible.","transcript":"It's pretty clear: these last ditch talks have gotten nowhere and there is nothing the West can do if the Russian speaker of Crimea want to break away from Ukraine and join Russia.","imgSrc":"http://i.vimeocdn.com/video/475766285_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782900","title":"let alone","description":"\"Let alone\": not to mention.","transcript":"And farmers who've never seen let alone tasted the products that rely on their daily toil.","imgSrc":"http://i.vimeocdn.com/video/475766306_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782969","title":"let alone","description":"\"Let alone\": not to mention.","transcript":"We are acutely aware of the fact that this is only the beginning of a long road to prove that Oscar never intended to harm Reeva, let alone cause her death.","imgSrc":"http://i.vimeocdn.com/video/475766372_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782921","title":"let alone","description":"\"Let alone\": not to mention.","transcript":"It's impossible to sit down let alone lie down on Nikumaroro without the crabs beginning to nibble at you.","imgSrc":"http://i.vimeocdn.com/video/475766391_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783007","title":"low blow","description":"\"Low blow\": an unexpected move; a surprise attack; an illegal move; an insult.","transcript":"Now that's what most men do, they do this: it makes him look like he's expecting a low blow.","imgSrc":"http://i.vimeocdn.com/video/475766387_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783034","title":"magic wand","description":"\"Magic wand\": any seemingly magical solution to a difficult problem; an easy way to solve a problem.","transcript":"While they are celebrating and jubilation, many would tell you that the country faces a lot of challenges still. When Libians took to the polls back in July they were expecting a magic wand solution of sort for their problems.","imgSrc":"http://i.vimeocdn.com/video/475766418_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88523909","title":"mano-o-mano","description":"The term is Spanish and literally means \"hand to hand\" as in unarmed combat. However in its modern version  the term is used in any scenario where two (usually male) individuals are going to have some sort of competition.","transcript":"Putin persisted in laying out his theory as to why this was going on rather than actually talking you know... mano-o-mano to a fellow leader about what really was going on.","imgSrc":"http://b.vimeocdn.com/ts/467/012/467012946_100.jpg","ruTranscript":"Путин настоял на разъяснении своей теории о том, что происходит, но не на споре с лидерами других стран о том, что на самом деле происходит.","ruDescription":"Испанская идиома, буквально значит \"рука к руке\", то есть бой без оружия. Сегодня используется, когда речь идет о разного рода соревнованиях, противостояниях."},{"vimeoId":"95783103","title":"mea culpa","description":"\"Mea culpa\": \"through my fault\"; admission of having made a mistake by one's own fault.","transcript":"CIA director George Tenet's mea culpa came hours after the top Republican on the Intelligence Committee placed the blame squarely on Tenet for allowing false information to get into the president's State of the Union address.","imgSrc":"http://i.vimeocdn.com/video/475766585_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783070","title":"mea culpa","description":"\"Mea culpa\": \"through my fault\"; admission of having made a mistake by one's own fault.","transcript":"He is going to lay out a kind of big mea culpa in a narrative of a company expanding so quickly with such enormous success that it started to getting it's priorities wrong.","imgSrc":"http://i.vimeocdn.com/video/475766440_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783141","title":"melting pot","description":"\"Melting pot\": a location (country, area or maybe a situation) in which many races, ideas, etc, are mixed.","transcript":"America historically has always been a nation of immigrants and a melting pot.","imgSrc":"http://i.vimeocdn.com/video/475766590_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783183","title":"middle ground","description":"\"The middle ground\": something that two people or groups that are arguing can agree about.","transcript":"About this disputed islands between Japan and China in the East China Sea and the President didn't try to walk some middle ground. He definitively said he sides with Japan on this.","imgSrc":"http://i.vimeocdn.com/video/475766727_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86836570","title":"milk and cookies","description":"Doing the good thing. Behaving, and not drifting too far off the edge, and pushing the envelope. In the 70's kids would party and go live on the edge at their parties. The saying, \"having milk and cookies\" meant you were not going to have alcohol, or other mind altering subjects to exchange with one another.","transcript":"From the early days of instant fame and a “milk-and-cookies” reputation that went sour to what happened that night?","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658131_100.jpg","ruTranscript":"От первых дней мгновенной славы и испорченной репутации пай-мальчика к тому, что произошло вчера?","ruDescription":"Вести себя хорошо, не бросаться в крайности."},{"vimeoId":"95782020","title":"naked eye","description":"\"Naked eye\":  The eye unassisted by an instrument of some kind (optical for instance).","transcript":"This allows you to look for signs of trauma or illness not visible to the naked eye.","imgSrc":"http://i.vimeocdn.com/video/475765174_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88520742","title":"neck and neck","description":"\"Neck and neck\":if two people who are competing are neck and neck, they are very close and either of them could win","transcript":"Voting is under way in Poland where it's hoped that electors will  break the deadlock in the country's presidential election. The last opinion poll suggested that the candidates Donald Tusk and Lech Kaczynski, were running neck and neck.","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009035_100.jpg","ruTranscript":"Голосование в Польше идет полным ходом, там надеются, что избиратели смогут сдвинуть выборы с мертвой точки. Последний опрос мнений показал, что кандидаты идут почти наравне.","ruDescription":"Соревноваться при незначительном отрыве лидера от отстающего, так, что победить может любой."},{"vimeoId":"88520726","title":"neck and neck","description":"\"Neck and neck\":if two people who are competing are neck and neck, they are very close and either of them could win","transcript":"Now, polls are showing that Obama won the debate but the race  is still very, very close - pretty much neck and neck.","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009001_100.jpg","ruTranscript":"Сейчас опросы показывают, что Обама выиграл дебаты, но отрыв все еще очень и очень мал.","ruDescription":"Соревноваться при незначительном отрыве лидера от отстающего, так, что победить может любой."},{"vimeoId":"95783211","title":"not a moment too soon","description":"\"Not a moment too soon\": just in time; almost too late.","transcript":"Look, Rarity, Applejack loaned me a harmonica! Isn't that great? Oh, and not a moment too soon!","imgSrc":"http://i.vimeocdn.com/video/475766692_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053385","title":"off the charts","description":"\"Off the charts\": much more than is usual.","transcript":"So why does NASA want to start prospecting in the place with the degree of difficulty off the charts?","imgSrc":"http://i.vimeocdn.com/video/472988932_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89277035","title":"on the back foot","description":"If you are \"on your back foot\", you are at a disadvantage and forced to be defensive of your position.","transcript":"The government is pretty confident it would win the majority of that by-elections and it feels it just turned the tide against Golden Dawn. It's got this party on the back foot.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957806_100.jpg","ruTranscript":"Правительство уверено в том, что оно победит в выборах и думает, что переломило ход противостояния с Золотой Зарей. Оно поставило эту организацию в уязвимое положение.","ruDescription":"В уязвимом положении, в котором приходится обороняться."},{"vimeoId":"89277028","title":"on the back foot","description":"If you are \"on your back foot\", you are at a disadvantage and forced to be defensive of your position.","transcript":"This morning the dollar is on the back foot.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957801_100.jpg","ruTranscript":"Положение доллара этим утром стало слабым.","ruDescription":"В уязвимом положении, в котором приходится обороняться."},{"vimeoId":"89277017","title":"on the back foot","description":"If you are \"on your back foot\", you are at a disadvantage and forced to be defensive of your position.","transcript":"Analysts say that if the US production continues at this pace it could potentially overtake both countries by the end of the decade. That caught the Middle East oil producers on the back foot.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957809_100.jpg","ruTranscript":"Аналитики считают, что если американское производство сохранит такие темпы, оно может превысить показатели обеих стран к концу десятилетия. Эти известия застали ближневосточные нефтяные компании врасплох.","ruDescription":"В уязвимом положении, в котором приходится обороняться."},{"vimeoId":"87409052","title":"on the cheap","description":"“on the cheap” means inexpensively; economically: She enjoys traveling on the cheap.","transcript":"A bigger international intervention might have kept this country intact. Instead, it's peacekeeping on the cheap. And for these embattled Muslim communities, the bleakest future.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455200_100.jpg","ruTranscript":"Более масштабная международная интервенция могла бы сохранить эту страну в целости. Вместо этого, мы имеем вялые миротворческие миссии, а эти готовые к войне мусульманские народы - самое мрачное будущее.","ruDescription":"Дешево, экономично."},{"vimeoId":"88520762","title":"on the edge","description":"\"On the edge\" - nervous or worried; on the verge of becoming irrational.","transcript":"And within months she became Bill's mistress. Back then I liked to live on the edge. I bored easily.","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009041_100.jpg","ruTranscript":"И через несколько месяцев она стала любовницей Билла. Тогда мне нравилось жить безрассудно. Мне быстро становилось скучно.","ruDescription":"Нервный, обеспокоенный; на грани безрассудства."},{"vimeoId":"95783243","title":"on the house","description":"\"On the house\": for free (usually applied for food or drinks).","transcript":"On the house.","imgSrc":"http://i.vimeocdn.com/video/475766719_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88520777","title":"on the sidelines","description":"\"On the sidelines\": to not be actively involved in something.","transcript":"...where we've connected businesses to research universities that can help America lead the world in advanced technologies.  Listen, China and Europe aren't standing on the sidelines.","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009040_100.jpg","ruTranscript":"…где мы связывались с бизнесменами, чтобы найти университеты, которые помогут Америке стать мировыми лидерами в сфере высоких технологий. Послушайте, Китай и Европа не стоят в стороне.","ruDescription":"Быть незадействованным в чем-либо."},{"vimeoId":"89498145","title":"out of the blue","description":"\"Out of the blue\": from an unexpected or unforeseen source; at a completely unexpected time.","transcript":"Out of the blue you came to me and blew away my misery.","imgSrc":"http://b.vimeocdn.com/ts/468/270/468270153_100.jpg","ruTranscript":"Ты пришла ко мне из ниоткуда и унесла мое страдание.","ruDescription":"Из ниоткуда, внезапно."},{"vimeoId":"93053056","title":"out of your hair","description":"\"To be out of someone's hair\": to stop bothering someone; to stop troubling someone with your business","transcript":"- Well, it's a long story. I'm just here to check on the decorations and then I'll be out out of your hair. - Out of my hair? What about your hair? ","imgSrc":"http://i.vimeocdn.com/video/472988460_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88091729","title":"piece of cake","description":"\"Piece of cake\" means that something is easy to do","transcript":"I mean, it's not a piece of cake. It's going to be a lot of work.","imgSrc":"http://i.vimeocdn.com/video/466407743_100x75.jpg","ruTranscript":"Я имею в виду, что это не так легко. Это потребует много работы.","ruDescription":"Легкая задача."},{"vimeoId":"88091749","title":"piece of cake","description":"\"Piece of cake\" means that something is easy to do","transcript":"As the English like to say, it's been a piece of cake.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407757_100.jpg","ruTranscript":"Как любят говорить англичане, это был \"кусок пирога\" (легко).","ruDescription":"Легкая задача."},{"vimeoId":"95783288","title":"pitch black","description":"\"Pitch black\": very black; as black as pitch.","transcript":"He knew nothing of the explosion until it thundered towards him. As it went over top of our heads there was pitch black and we couldn't see nothing.","imgSrc":"http://i.vimeocdn.com/video/475766738_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87409075","title":"play hard ball","description":"To \"play hard ball\" is to be so determined to get what you want, especially in business,  that you use methods that are unfair or harm other people (often + with )","transcript":"He does play hard ball.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455190_100.jpg","ruTranscript":"Он действительно работает жестко.","ruDescription":"Быть настроенным добиться цели, особенно в бизнесе, с применением нечестных способов, которые могут навредить другим людям."},{"vimeoId":"86387247","title":"pretty penny","description":"“Pretty penny” is a considerable sum of money: I paid a pretty penny for that ring.","transcript":"Companies are gonna…have to think twice before hiring new full-time workers and it’s going to cost them a pretty penny.","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039306_100.jpg","ruTranscript":"Компаниям придется думать дважды, прежде чем нанимать новых работников на полный рабочий день, и это будет стоить им немалых денег.","ruDescription":"Солидная сумма денег."},{"vimeoId":"95783309","title":"prying eye","description":"\"Prying eyes\": things (like cameras) or people (neighbours or government workers) who are watching you usually to report your wrongdoings or gossipping around you.","transcript":"These days the prying eyes of the state seem to be everywhere. Government say they need surveilliance to find terrorism and crime.","imgSrc":"http://i.vimeocdn.com/video/475766765_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86387254","title":"rags to riches","description":"a situation where someone goes from being poor to being rich","transcript":"There's no going under when you're kicked to the ground; rags to riches, rags to riches.","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039309_100.jpg","ruTranscript":"Когда тебя втоптали в землю, ты уже не можешь проиграть; из грязи в князи, из грязи в князи.","ruDescription":"Ситуация, когда бедный человек становится богачом."},{"vimeoId":"87409108","title":"red tape","description":"\"red tape\" is over-strict attention to the wording and details of rules and regulations,  especially by government workers. (From the color of the tape used by government departments in England to tie up bundles of documents); a ceremony.","transcript":"...also phase two of the European commission's plan to cut red tape...","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455215_100.jpg","ruTranscript":"…также второй фазой плана Еврокомиссии является борьба с бюрократией…","ruDescription":"Чрезмерно строгое отношение к формулировкам или правилам, особенно со стороны госслужащих; торжественное мероприятие."},{"vimeoId":"87409171","title":"red tape","description":"\"red tape\" is over-strict attention to the wording and details of rules and regulations,  especially by government workers. (From the color of the tape used by government departments in England to tie up bundles of documents); a ceremony.","transcript":"But red tape makes this painfully slow process.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455305_100.jpg","ruTranscript":"Но бумажная волокита делает это ужасно медленным процессом.","ruDescription":"Чрезмерно строгое отношение к формулировкам или правилам, особенно со стороны госслужащих; торжественное мероприятие."},{"vimeoId":"87409131","title":"red tape","description":"\"red tape\" is over-strict attention to the wording and details of rules and regulations,  especially by government workers. (From the color of the tape used by government departments in England to tie up bundles of documents); a ceremony.","transcript":"On the one hand they feel sometimes overburdened by what they call 'red tape' or administrative rules issued by Brussels...","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455216_100.jpg","ruTranscript":"С одной стороны, иногда они чувствуют себя слишком обязанными из-за правил, принятых Брюсселем…","ruDescription":"Чрезмерно строгое отношение к формулировкам или правилам, особенно со стороны госслужащих; торжественное мероприятие."},{"vimeoId":"87409159","title":"red tape","description":"\"red tape\" is over-strict attention to the wording and details of rules and regulations,  especially by government workers. (From the color of the tape used by government departments in England to tie up bundles of documents); a ceremony.","transcript":"The red tape of travel paperwork. The passengers did everything right but with red tape it's all too easy to go wrong.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455310_100.jpg","ruTranscript":"Бюрократия документов для поездок. Пассажири сделали все верно, но с этой чрезмерной строгостью слишком легко ошибиться.","ruDescription":"Чрезмерно строгое отношение к формулировкам или правилам, особенно со стороны госслужащих; торжественное мероприятие."},{"vimeoId":"87409190","title":"red tape","description":"\"red tape\" is over-strict attention to the wording and details of rules and regulations,  especially by government workers. (From the color of the tape used by government departments in England to tie up bundles of documents); a ceremony.","transcript":"Despite being a day filled with red tape, of meetings, of bureaucracy, of trying to get media accreditation...","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455323_100.jpg","ruTranscript":"Несмотря на то, что день был наполнен торжественными мероприятиями, встречами, бюрократией, попытками получить журналистскую аккредитацию…","ruDescription":"Чрезмерно строгое отношение к формулировкам или правилам, особенно со стороны госслужащих; торжественное мероприятие."},{"vimeoId":"87409179","title":"red tape","description":"\"red tape\" is over-strict attention to the wording and details of rules and regulations,  especially by government workers. (From the color of the tape used by government departments in England to tie up bundles of documents); a ceremony.","transcript":"- Is this a good thing or just more red tape? - I think, there's always more red tape coming with regulation.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455314_100.jpg","ruTranscript":"- Это действительно что-то хорошее или очередная мишура? - Мне кажется, в каждом новом правиле больше мишуры.","ruDescription":"Чрезмерно строгое отношение к формулировкам или правилам, особенно со стороны госслужащих; торжественное мероприятие."},{"vimeoId":"86836588","title":"rock'n'roll","description":"In Vietnam US troops used the term \"rock ‘n’ roll\" to describe firing full auto with a firearm, especially a machine gun. Please find info about  the “drop of the hat” idiom in our library.","transcript":"What difference does it make? Why leave a living witness? Drop of the hat – these guys were rock’n’roll.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658152_100.jpg","ruTranscript":"Что это изменит? Зачем оставлять свидетеля в живых? Один миг - и эти парни начали стрелять.","ruDescription":"Американские солдаты во Вьетнаме так называли стрельбу в автоматическом режиме, особенно из пулемета. Пожалуйста, ознакомьтесь со значением идиомы \"drop of the hat\" в нашей коллекции."},{"vimeoId":"88091772","title":"roger that","description":"\"Roger that\" is usually used in radio transmissions such as military communications, meaning \"I understand\" or \"I hear you.\" Also: yes, I acknowledge what you are saying, I agree, yes this is true, you are right.","transcript":"- I was ordered not tell them what happened, sir. - You were ordered not to tell them? - Roger that, sir.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407786_100.jpg","ruTranscript":"- Мне приказали не сообщать им о том, что случилось, сэр. - Тебе приказали не сообщать им? - Так точно, сэр.","ruDescription":"Используется в военной радиокоммуникации в значении \"Я понял\" или \"Я вас слышу\". Также значит: я признаю то, что вы говорите, я согласен, это правда, вы правы."},{"vimeoId":"88091793","title":"saber rattling","description":"\"Saber rattling\" is a threatening behavior which is intended to frighten someone","transcript":"My sense of Moscow is although it is saber rattling, it does not want that.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407870_100.jpg","ruTranscript":"Мое впечатление о действиях Москвы таково: хоть они и пугают, но это не то, чего здесь хотят.","ruDescription":"Угрожающее поведение с целью запугать."},{"vimeoId":"88091855","title":"saber rattling","description":"\"Saber rattling\" is a threatening behavior which is intended to frighten someone","transcript":"The Bush administration says it wants an end to North Korean saber rattling and multilateral talks involving South Korea, Japan and the Chinese.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407911_100.jpg","ruTranscript":"Администрация Буша заявила, что хочет положить конец угрожающим действиям Северной Кореи и переговорам между Южной Кореей, Японией и Китаем.","ruDescription":"Угрожающее поведение с целью запугать."},{"vimeoId":"88091829","title":"saber rattling","description":"\"Saber rattling\" is a threatening behavior which is intended to frighten someone","transcript":"...international fears about this saber rattling.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407891_100.jpg","ruTranscript":"…международная обеспокоенность таким угрожающим поведением.","ruDescription":"Угрожающее поведение с целью запугать."},{"vimeoId":"88091811","title":"saber rattling","description":"\"Saber rattling\" is a threatening behavior which is intended to frighten someone","transcript":"Nevertheless for all their saber rattling the Soviets seemed to be steering themselves to start  a thaw in East-West relations.","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407872_100.jpg","ruTranscript":"Несмотря на свою угрожающую политику, СССР был нацелен на оттепель в отношениях Востока и Запада.","ruDescription":"Угрожающее поведение с целью запугать."},{"vimeoId":"95783338","title":"ship of the desert","description":"\"Ship of the desert\": a camel.","transcript":"And now the so called \"ships of the desert\" have their chance to complete the image as they strut their stuff in front of the admiring crowd.","imgSrc":"http://i.vimeocdn.com/video/475766881_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783370","title":"ship of the desert","description":"\"Ship of the desert\": a camel.","transcript":"The ship of the desert has always played a vital role in the lives of Arabia's bedouin desert dwellers. In such a harsh environment the camel provided food, clothing, shelter and transportation.","imgSrc":"http://i.vimeocdn.com/video/475766902_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88520805","title":"short of","description":"\"Short of\":\n1)not having enough of something (1st video)\n2)not including something; other than; without resorting to (2nd video)","transcript":"We should be thinking about some drinking.- Well, mister Handsome, why don't you get one? - I'm sorry, honey, I'm short of money.","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009117_100.jpg","ruTranscript":"- Нам бы сейчас выпить. - Так что же вы не выпьете, мистер Красавчик? - Прости, дорогая, у меня нет денег.","ruDescription":"1) Не иметь чего-либо (сюжет 1); 2) Не включая что-либо; кроме; не обращаясь к (сюжет 2)."},{"vimeoId":"88091884","title":"short of","description":"\"Short of\":\n1)not having enough of something (1st video)\n2)not including something; other than; without resorting to (2nd video)","transcript":"...many people thought that president Putin having backed Mr. Yanukovich twice (once in the Orange Revolution) and having seen him ousted, that he wanted to be short of him, but no...","imgSrc":"http://b.vimeocdn.com/ts/466/407/466407928_100.jpg","ruTranscript":"…многие думали, что президент Путин, при котором Россия дважды поддержала господина Януковича (в первый раз - во время Оранжевой революции) и при котором Януковича выгнали из страны, хочет избавиться от него, но нет…","ruDescription":"1) Не иметь чего-либо (сюжет 1); 2) Не включая что-либо; кроме; не обращаясь к (сюжет 2)."},{"vimeoId":"86836752","title":"silver lining","description":"a comforting or hopeful aspect of an otherwise desperate or unhappy situation (especially in the phrase every cloud has a silver lining); lining is the material that covers the inner surface of something","transcript":"No matter how dark the cloud, there’s always a thing silver lining.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658378_100.jpg","ruTranscript":"Неважно насколько все плохо, в любой ситуации есть хоть маленький плюс.","ruDescription":"Успокаивающее или обнадеживающее обстоятельство в отчаянной ситуации."},{"vimeoId":"86836775","title":"silver lining","description":"a comforting or hopeful aspect of an otherwise desperate or unhappy situation (especially in the phrase every cloud has a silver lining); lining is the material that covers the inner surface of something","transcript":"Yeah, silver lining though, now that the whole truth and nothing but is out is any chance now for you and me?","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658400_100.jpg","ruTranscript":"Да, но плюс в том, что теперь, когда все знают правду и ничего, кроме правды… У нас с тобой есть шансы?","ruDescription":"Успокаивающее или обнадеживающее обстоятельство в отчаянной ситуации."},{"vimeoId":"86836827","title":"silver lining","description":"a comforting or hopeful aspect of an otherwise desperate or unhappy situation (especially in the phrase every cloud has a silver lining); lining is the material that covers the inner surface of something","transcript":"I think we are fortunate that, you know the German inability to collate and focus its programs and having an impact on the allied strategic bombing campaign, is really a silver lining for democracy.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658528_100.jpg","ruTranscript":"Мне кажется нам повезло в том, что немцы не могут критически оценить и сфокусировать свои программы, поэтому иметь влияние на стратегию союзников по бомбардировке - это облегчающее обстоятельство для демократии.","ruDescription":"Успокаивающее или обнадеживающее обстоятельство в отчаянной ситуации."},{"vimeoId":"86836736","title":"silver lining","description":"a comforting or hopeful aspect of an otherwise desperate or unhappy situation (especially in the phrase every cloud has a silver lining); lining is the material that covers the inner surface of something","transcript":"You know you see a silver lining at the end of the tunnel.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658374_100.jpg","ruTranscript":"Вы знаете, в конце туннеля всегда видишь что-то хорошее.","ruDescription":"Успокаивающее или обнадеживающее обстоятельство в отчаянной ситуации."},{"vimeoId":"86836705","title":"silver lining","description":"a comforting or hopeful aspect of an otherwise desperate or unhappy situation (especially in the phrase every cloud has a silver lining); lining is the material that covers the inner surface of something","transcript":"One silver in this ah…is that thirteen members of this Council supported the resolution.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658295_100.jpg","ruTranscript":"Хоть одно успокаивает - тринадцать членов этого Совета поддержали резолюцию.","ruDescription":"Успокаивающее или обнадеживающее обстоятельство в отчаянной ситуации."},{"vimeoId":"86836801","title":"silver lining","description":"a comforting or hopeful aspect of an otherwise desperate or unhappy situation (especially in the phrase every cloud has a silver lining); lining is the material that covers the inner surface of something","transcript":"There’s a little bit of small silver lining in this crisis where while filling up at the gas pump won’t be so painful anymore.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658444_100.jpg","ruTranscript":"В этом кризисе есть один небольшой плюс: заправляться газом больше не будет больно.","ruDescription":"Успокаивающее или обнадеживающее обстоятельство в отчаянной ситуации."},{"vimeoId":"86836619","title":"silver lining","description":"a comforting or hopeful aspect of an otherwise desperate or unhappy situation (especially in the phrase every cloud has a silver lining); lining is the material that covers the inner surface of something","transcript":"There is a faint silver lining in all of this - the disasters providing a unique opportunity for scientists.","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658225_100.jpg","ruTranscript":"Во всем этом есть маленький плюс - катастрофы дают ученым уникальные возможности.","ruDescription":"Успокаивающее или обнадеживающее обстоятельство в отчаянной ситуации."},{"vimeoId":"95783410","title":"silver tongue","description":"\"Silver-tongued\": eloquent; a silver-tongued person knows how to persuade people to do what he or she wants.","transcript":"It's like that he is the lone ranger riding in just when George Bush needs him, no silver bullet but a silver tongue. If we are right as I believe with every fiber of instinct and conviction I have that we are.","imgSrc":"http://i.vimeocdn.com/video/475766923_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053061","title":"sitting duck","description":"\"Sitting duck\": an easy target asking for attack.","transcript":"You'd better take the money out of that fun, because if you don't you're gonna become a sitting duck for a hostile takeover.","imgSrc":"http://i.vimeocdn.com/video/472988462_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053077","title":"slip of the tongue","description":"\"Slip of the tongue\": accidentally saying the wrong/similar word","transcript":"and we did agree on anything…  everything as you might expect I… that was the slip of the tongue here","imgSrc":"http://i.vimeocdn.com/video/472988463_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88525433","title":"speak softly but carry a big stick","description":"A proverb advising the tactic of caution and non-aggression, backed up by the ability to do violence if required. The widespread use of West African proverb 'speak softly and carry a big stick, you will go far' began with Roosevelt.","transcript":"The maxim of US President a century ago Teddy Roosevelt: \"Walk softly but carry a big stick\". (error: should be \"speak\" instead of \"walk\")","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014850_100.jpg","ruTranscript":"Афоризм, произнесенный президентом США Тедди Рузвельтом столетие назад: \"Ступай тихо, но имей при себе большую палку\" (Ошибка: вместо \"ступай\" должно быть \"говори\").","ruDescription":"Пословица, в которой содержится совет проявлять осторожность и не проявлять агрессии, но быть при этом способным применить силу, если это потребуется. Внедрил эту западноафриканскую пословицу Т. Рузвельт."},{"vimeoId":"88525418","title":"speak softly but carry a big stick","description":"A proverb advising the tactic of caution and non-aggression, backed up by the ability to do violence if required. The widespread use of West African proverb 'speak softly and carry a big stick, you will go far' began with Roosevelt.","transcript":"\"Speak softly and carry a big stick. End of quote. I promise you, the President has a big stick. I promise you\".","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014841_100.jpg","ruTranscript":"\"Говори тихо, но имей при себе большую палку. Конец цитаты. Я уверяю вас: у президента есть большая палка. Я уверяю вас в этом.","ruDescription":"Пословица, в которой содержится совет проявлять осторожность и не проявлять агрессии, но быть при этом способным применить силу, если это потребуется. Внедрил эту западноафриканскую пословицу Т. Рузвельт."},{"vimeoId":"86387262","title":"square one","description":"square one is the beginning stage or starting point","transcript":"Go back to square one and do  this step by step.","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039312_100.jpg","ruTranscript":"Вернуться к началу и делать это поэтапно, шаг за шагом.","ruDescription":"Стадия начала или точка отсчета."},{"vimeoId":"87409208","title":"stand in the way","description":"To \"stand in the way\" is to try to stop or prevent something from happening.","transcript":"She eventually discovers this make shift classroom on the side of a road and promptly sits down to learn. And Wadley, we see, won't let her family's poverty stand in the way.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455333_100.jpg","ruTranscript":"Впоследствии она узнала об этом убогом учебном кабинете у дороги и начинает там заниматься. Похоже, Уэдли не позволит нищете ее семьи встать у нее на пути.","ruDescription":"Пытаться предотвратить что-либо."},{"vimeoId":"88091933","title":"state-of-the-art","description":"\"State-of-the-art\" equipment and machines are the most modern and of the best quality available.","transcript":"Today soldiers go into battle with state-of-the-art equipment costing billions of dollars.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408042_100.jpg","ruTranscript":"Сегодня солдаты идут в бой в высокотехнологичном обмундировании, которое стоит миллиарды долларов.","ruDescription":"Лучшие по качеству (об оборудовании, машинах)."},{"vimeoId":"88091907","title":"state-of-the-art","description":"\"State-of-the-art\" equipment and machines are the most modern and of the best quality available.","transcript":"...a state-of-the-art commercial center.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408033_100.jpg","ruTranscript":"…современный торговый центр.","ruDescription":"Лучшие по качеству (об оборудовании, машинах)."},{"vimeoId":"86387271","title":"sugar pill","description":"Sugar pills, or the placebo pills, are the last week of pills in your pack. Taking these pills keeps you in the habit of taking a pill every day.","transcript":"With regards to the “sugar pill” scenario nothing can be further from the truth..","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039321_100.jpg","ruTranscript":"При отказе от таблеток-пустышек, ничто не может быть так далеко от истины…","ruDescription":"Таблетки-пустышки (плацебо), принимая которые, вы привыкаете пить по одной таблетке в день."},{"vimeoId":"87409234","title":"take stock","description":"take stock is to examine a situation carefully","transcript":"Millions people in Britain have been taking stock of the damage wreaked by Friday's ferocious storms which claimed the lives of two people.","imgSrc":"http://i.vimeocdn.com/video/465455378_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87409234","title":"take stock","description":"take stock is to examine a situation carefully","transcript":"Millions people in Britain have been taking stock of the damage wreaked by Friday's ferocious storms which claimed the lives of two people.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455378_100.jpg","ruTranscript":"Миллионы людей в Великобритании оценивают понесенный ими ущерб от пятничного шторма, унесшего жизни двух человек.","ruDescription":"Внимательно изучить ситуацию."},{"vimeoId":"95783435","title":"the devil is in the details","description":"\"The devil is in the details\": small things that are often overlooked can cause serious problems later on.","transcript":"But the devil is the detail on this and now everybody is on board with the idea so we'll be discussing that further.","imgSrc":"http://i.vimeocdn.com/video/475766997_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88092439","title":"The game of chicken","description":"\"The game of chicken\"is an influential model of conflict for two players in game theory.  The principle of the game is that while each player prefers not to yield to the other, the worst possible outcome occurs when both players do not yield.","transcript":"Bike-riding protester played chicken with the bus!","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408696_100.jpg","ruTranscript":"Этот протестующий велосипедист соревновался в упорстве с автобусом.","ruDescription":"Модель конфликта между двумя игроками в теории игр. Принцип игры в том, что каждый игрок предпочитает не сдаваться другому, и худший сценарий имеет место когда оба игрока не сдаются."},{"vimeoId":"88092406","title":"The game of chicken","description":"\"The game of chicken\"is an influential model of conflict for two players in game theory.  The principle of the game is that while each player prefers not to yield to the other, the worst possible outcome occurs when both players do not yield.","transcript":"Come on. Let's go!- Goddamn it! Don't play chicken with the goddamned jet!","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408622_100.jpg","ruTranscript":"Давай, поехали! - Черт возьми! Не пытайся играть с чертовым самолетом!","ruDescription":"Модель конфликта между двумя игроками в теории игр. Принцип игры в том, что каждый игрок предпочитает не сдаваться другому, и худший сценарий имеет место когда оба игрока не сдаются."},{"vimeoId":"88092463","title":"The game of chicken","description":"\"The game of chicken\"is an influential model of conflict for two players in game theory.  The principle of the game is that while each player prefers not to yield to the other, the worst possible outcome occurs when both players do not yield.","transcript":"To test the power of this metal warrior Ryan challenged his 7-year-old son Nicolas to a game of chicken. You'll never defeat me!","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408705_100.jpg","ruTranscript":"Чтобы испытать мощь этого металлического воина, Райан вызвал своего семилетнего сына на поединок. Тебе меня не победить!","ruDescription":"Модель конфликта между двумя игроками в теории игр. Принцип игры в том, что каждый игрок предпочитает не сдаваться другому, и худший сценарий имеет место когда оба игрока не сдаются."},{"vimeoId":"93053085","title":"the pen is mightier than the sword","description":"\"The pen is mightier than the sword\": the thins you write (orders for example) can be more powerful that direct violence.","transcript":"What historians will make of our electronic communication is anybody's guess but one thing is already certain: the pen may be mightier that the sword but it's no match for e-mail.","imgSrc":"http://i.vimeocdn.com/video/472988523_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783523","title":"thin air","description":"\"Thin air\": nowhere to be found; sheer nothingness.","transcript":"We've made money out of thing air.","imgSrc":"http://i.vimeocdn.com/video/475767044_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783489","title":"thin air","description":"\"Thin air\": nowhere to be found; sheer nothingness.","transcript":"Here is where we convert the methanol into petrol. Fuel right out of thing air.","imgSrc":"http://i.vimeocdn.com/video/475767018_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783462","title":"thin air","description":"\"Thin air\": nowhere to be found; sheer nothingness.","transcript":"The man who conjured a 3.6 trillion dollar industry out of thin air.","imgSrc":"http://i.vimeocdn.com/video/475767007_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88523937","title":"through thick and thin","description":"\"Through thick and thin\": if you stay with or support someone through thick and thin, you always stay with or support them, even in difficult situations.","transcript":"The mother doesn't have to face the coming birth alone. Her immediate family will be in attendance.A tightly bound sisterhood that sticks up for each other through thick and thin.","imgSrc":"http://b.vimeocdn.com/ts/467/013/467013009_100.jpg","ruTranscript":"Матери не придется ждать родов в одиночестве. Ее ближайшие родичи будут рядом. Это тесно связанное содружество сестер, которые поддержат друг друга в любой беде.","ruDescription":"Через все преграды."},{"vimeoId":"88523925","title":"through thick and thin","description":"\"Through thick and thin\": if you stay with or support someone through thick and thin, you always stay with or support them, even in difficult situations.","transcript":"...despite Tube strikes! - I did it! I made it! Through thick and thin! Ah?","imgSrc":"http://b.vimeocdn.com/ts/467/012/467012955_100.jpg","ruTranscript":"…несмотря на забастовки работников метро! - Я успел! Через все преграды, а?","ruDescription":"Через все преграды."},{"vimeoId":"88520821","title":"tinderbox","description":"\"Tinderbox\": a metal box for holding tinder; potentially explosive place or situation. tinder: dry material (such as wood or grass) that burns easily and can be used to start a fire.","transcript":"Fires happen too often here. No one's sure what causes them: the tinderbox housing  or desperate acts of arson.","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009151_100.jpg","ruTranscript":"Пожары здесь происходят слишком часто. Никто не уверен, из-за чего: легковоспламеняющиеся материалы, из которых построены дома или поджоги.","ruDescription":"Металлическая коробка для хранения трута; способное взорваться место либо ситуация."},{"vimeoId":"95783546","title":"to add fuel to the fire","description":"\"To add fuel to the fire\": to make thing worse.","transcript":"Yeah, Anderson, that's right, that's certainly sort of fueling the fire.","imgSrc":"http://i.vimeocdn.com/video/475767041_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86387179","title":"to add insult to injury","description":"To “add insult to injury” is to make a bad situation worse; to hurt the feelings of a person who has already been hurt.","transcript":"…policies of the past that elevated oil company profits over safety. To add insult to injury every summer the price of gas goes up.","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039179_100.jpg","ruTranscript":"…политика прошлых лет, которая ставила прибыль нефтяной компании выше безопасности. Что еще хуже, цена на газ растет каждое лето.","ruDescription":"Усугубить положение."},{"vimeoId":"88091970","title":"to bang the drum","description":"\"To bang the drum\" is to to speak enthusiastically about a belief or idea in order to persuade other people to support it too.","transcript":"This is the latest statement from the Russian Foreign Ministry which everyday has been banging the drum about its concern of events in Ukraine.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408136_100.jpg","ruTranscript":"Это последнее заявление российского МИДа, который трезвонил об озабоченности событиями на Украине.","ruDescription":"Увлеченно говорить о чем-то, пытаясь убедить других поддержать это."},{"vimeoId":"93053123","title":"to be dressed to the nines","description":"\"To be dressed up to the nines\": to be wearing very fashionable or formal clothes for a special occasion.","transcript":"All you will see is a girl you once knew although she's dressed up to the nines.","imgSrc":"http://i.vimeocdn.com/video/472988550_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053108","title":"to be dressed to the nines","description":"\"To be dressed up to the nines\": to be wearing very fashionable or formal clothes for a special occasion.","transcript":"And they are dressed to the nines and are on their way to Washington.","imgSrc":"http://i.vimeocdn.com/video/472988535_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783611","title":"to beat swords into ploughshares","description":"\"To beat swords into ploughshares\": to turn sword (as a sharp metal military tool) into a ploughshare (as a similar sharp metal peaceful instrument) means to use weapons for peaceful civillian needs.","transcript":"Gaza is quiet again but no one on either side of the border is beating their swords into ploughshares.","imgSrc":"http://i.vimeocdn.com/video/475767181_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783577","title":"to beat swords into ploughshares","description":"\"To beat swords into ploughshares\": to turn sword (as a sharp metal military tool) into a ploughshare (as a similar sharp metal peaceful instrument) means to use weapons for peaceful civillian needs.","transcript":"And today South Africa's weapons-grade uranium left over from the apartheid era is being turned into medical isotopes that can detect cancer and other diseases. Swords into ploughshares indeed.","imgSrc":"http://i.vimeocdn.com/video/475767166_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783646","title":"to beat swords into ploughshares","description":"\"To beat swords into ploughshares\": to turn sword (as a sharp metal military tool) into a ploughshare (as a similar sharp metal peaceful instrument) means to use weapons for peaceful civillian needs.","transcript":"They shall beat their swords into ploughshares. Yes, it means to turn weapons to peaceful uses.","imgSrc":"http://i.vimeocdn.com/video/475767212_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783681","title":"to bottle up","description":"\"To bottle up\": to constrict something as if it was put in a bottle.","transcript":"Koreans (when they experience trauma), they feel anger and sadness but they tend to bottle them up. We're trying to encourage emotional communication to let those feelings out.","imgSrc":"http://i.vimeocdn.com/video/475767226_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"86836433","title":"to break bread","description":"\"To break bread\" is to share one's belongings or assets with another person; to eat together","transcript":"...take advantage of the opportunity to break bread and cement relationships.","imgSrc":"http://b.vimeocdn.com/ts/464/657/464657925_100.jpg","ruTranscript":"…воспользоваться возможностью разделить прибыль и укрепить взаимоотношения.","ruDescription":"Разделить свое имущество с другим; поесть вместе; отметить событие."},{"vimeoId":"86836414","title":"to break bread","description":"\"To break bread\" is to share one's belongings or assets with another person; to eat together","transcript":"Some simple rules when breaking bread: be on time, the host will usually order,whatever's on offer - try it!","imgSrc":"http://b.vimeocdn.com/ts/464/657/464657960_100.jpg","ruTranscript":"Простые правила приглашения на обед: не опаздывайте, обычно заказывает приглашающий, поэтому что бы ни предлагалось - пробуйте!","ruDescription":"Разделить свое имущество с другим; поесть вместе; отметить событие."},{"vimeoId":"88091991","title":"to call the shots","description":"\"To call the shots\" - it means to be in charge/to be the boss/ There are two sorts of origins: the first refers to someone practising with a rifle and indicating where their target is going to be by calling it out in advance.  Another theory is that it comes from the game of billiards where the player announces in advance where they are going to hit the ball to.","transcript":"In today's Europe it's Germany that calls the shots.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408082_100.jpg","ruTranscript":"В современной Европе всем заправляет Германия.","ruDescription":"Быть главным, быть начальником."},{"vimeoId":"88092058","title":"to call the shots","description":"\"To call the shots\" - it means to be in charge/to be the boss/ There are two sorts of origins: the first refers to someone practising with a rifle and indicating where their target is going to be by calling it out in advance.  Another theory is that it comes from the game of billiards where the player announces in advance where they are going to hit the ball to.","transcript":"How significant is the fact that Egypt appears to be calling the shots in terms of the way that the Palestinians are reacting?","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408160_100.jpg","ruTranscript":"Насколько важен факт, что Египет руководит реакцией палестинцев?","ruDescription":"Быть главным, быть начальником."},{"vimeoId":"88092022","title":"to call the shots","description":"\"To call the shots\" - it means to be in charge/to be the boss/ There are two sorts of origins: the first refers to someone practising with a rifle and indicating where their target is going to be by calling it out in advance.  Another theory is that it comes from the game of billiards where the player announces in advance where they are going to hit the ball to.","transcript":"In secret, Tony would be calling the shots. Tony the tax-dodger has been offered complete confidentiality in an offshore tax haven.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408152_100.jpg","ruTranscript":"Тони в тайне будет всем руководить. Тони-\"налогонеплательщику\" предложили полную конфиденциальность в оффшорном налоговом раю.","ruDescription":"Быть главным, быть начальником."},{"vimeoId":"88092074","title":"to call the shots","description":"\"To call the shots\" - it means to be in charge/to be the boss/ There are two sorts of origins: the first refers to someone practising with a rifle and indicating where their target is going to be by calling it out in advance.  Another theory is that it comes from the game of billiards where the player announces in advance where they are going to hit the ball to.","transcript":"If you don't really know which government's calling the shots.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408168_100.jpg","ruTranscript":"Если вы не даже не знаете, какое правительство главное.","ruDescription":"Быть главным, быть начальником."},{"vimeoId":"88092105","title":"to call the shots","description":"\"To call the shots\" - it means to be in charge/to be the boss/ There are two sorts of origins: the first refers to someone practising with a rifle and indicating where their target is going to be by calling it out in advance.  Another theory is that it comes from the game of billiards where the player announces in advance where they are going to hit the ball to.","transcript":"Now, the man behind the president, calling the shots... was Colonel Juan Peron would-be dictator.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408194_100.jpg","ruTranscript":"А вот человек за президентом, командир… Это был полковник Хуан Перон, будущий диктатор.","ruDescription":"Быть главным, быть начальником."},{"vimeoId":"93053128","title":"to catch someone red-handed","description":"\"To catch someone red-handed\": to catch someone in the middle of doing something wrong.","transcript":"Russia says he was caught red handed.","imgSrc":"http://i.vimeocdn.com/video/472988555_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89498201","title":"to change hands","description":"\"To change hands\": to be sold or passed from owner to owner.","transcript":"This is how power changes hands here: bloodless, but in the shadow of kidnapping and at the end of AK-47.","imgSrc":"http://b.vimeocdn.com/ts/468/270/468270322_100.jpg","ruTranscript":"Вот как здесь переходит власть: без кровопролития, но с похищениями и автоматами Калашникова.","ruDescription":"Перейти от одного владельца к другому."},{"vimeoId":"88092134","title":"to checkmate","description":"\"To checkmate\": 1) to attack (a chess opponent's king) in such a manner that no escape or defense is possible, thus ending the game. 2) to defeat completely.","transcript":"Grandmaster has entered the political arena. But can he checkmate the President?","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408286_100.jpg","ruTranscript":"Гроссмейстер вышел на политическую арену. Но сможет ли он поставить мат президенту?","ruDescription":"1) Объявить шах и мат; 2) Безоговорочно победить."},{"vimeoId":"87408704","title":"to cobble together","description":"\"To cobble together\" is to do or make something quickly and not very carefully.\"  Cobble\" is a rock fragment between 6 and 25 cm in diameter, especially one that has been naturally rounded.","transcript":"And you have various levels of protocol,but they had to cobble together something very fast for Diana Princess of Wales when they decided she was not gonna have a state funeral. So they came up with the rubric of the \"ceremonial funeral\".","imgSrc":"http://i.vimeocdn.com/video/465454704_100x75.jpg","ruTranscript":"У них несколько уровней отчетности, но им пришлось быстро что-то придумать по принцессе Диане, когда было принято решение о том, что ее не будет государственных похорон. Поэтому они придумали новый вид похорон - \"торжественные\".","ruDescription":"Делать что-либо быстро и не слишком аккуратно."},{"vimeoId":"87408689","title":"to cobble together","description":"\"To cobble together\" is to do or make something quickly and not very carefully.\"  Cobble\" is a rock fragment between 6 and 25 cm in diameter, especially one that has been naturally rounded.","transcript":"It is all \"sticking plasters and quick fixes cobbled together for the TV cameras\".","imgSrc":"http://i.vimeocdn.com/video/465454656_100x75.jpg","ruTranscript":"Все это - торопливое приведение всего в порядок для телевидения.","ruDescription":"Делать что-либо быстро и не слишком аккуратно."},{"vimeoId":"89498270","title":"to come out of the closet","description":"\"To come out of the closet\":  to talk in public about something which you kept secret in the past because you were embarrassed about it;  to announce that you are attracted to people of the same sex.","transcript":"...kiss their partner in public or...or come out in public.","imgSrc":"http://b.vimeocdn.com/ts/468/270/468270351_100.jpg","ruTranscript":"…публично поцеловать своего партнера или… Или публично объявить себя геем.","ruDescription":"Публично раскрыть секрет; объявить себя гомосексуалистом."},{"vimeoId":"89498242","title":"to come out of the closet","description":"\"To come out of the closet\":  to talk in public about something which you kept secret in the past because you were embarrassed about it;  to announce that you are attracted to people of the same sex.","transcript":"In 2002 landmark ruling encouraged many homosexuals in this country to come out of the closet.","imgSrc":"http://b.vimeocdn.com/ts/468/270/468270309_100.jpg","ruTranscript":"В 2002 поворотное решение правительства вдохновило множество гомосексуалистов этой страны объявить себя таковыми.","ruDescription":"Публично раскрыть секрет; объявить себя гомосексуалистом."},{"vimeoId":"89498223","title":"to come out of the closet","description":"\"To come out of the closet\":  to talk in public about something which you kept secret in the past because you were embarrassed about it;  to announce that you are attracted to people of the same sex.","transcript":"Well, Ashraful actually came out of the closet if you like and back in June when he had a press-conference admitted  that he had been involved in spot-fixing","imgSrc":"http://b.vimeocdn.com/ts/468/270/468270285_100.jpg","ruTranscript":"Так, Ашрафул фактически раскрыл все карты и еще в июне на пресс-конференции он признался, что был задействован в договорных матчах.","ruDescription":"Публично раскрыть секрет; объявить себя гомосексуалистом."},{"vimeoId":"95783706","title":"to come together","description":"\"To come together\": to combine different thing or part in one; to agree on something.","transcript":"Oh, the decorations, the banquet… I really hope everything comes together in time for tomorrow.","imgSrc":"http://i.vimeocdn.com/video/475767299_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053147","title":"to cut the corners","description":"\"To cut the cornes\": to do something in an easy way.","transcript":"﻿Еven more worrying: the  mechanics of American Airlines are not the only ones cutting corners.","imgSrc":"http://i.vimeocdn.com/video/472988562_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053159","title":"to cut the crap","description":"\"To cut the crap\": to stop saying nonsense; to stop doing unnecessary things.","transcript":"- We gotta do something about it.  - Like what?  - We gotta find God and tell him to cut the crap .","imgSrc":"http://i.vimeocdn.com/video/472988573_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88520969","title":"to dawn on someone","description":"\"Dawn on someone\":  to become apparent to someone; [for something] to be suddenly realized by someone.","transcript":"That when Pistoreus says: it dawned on him that it could have been Riva (shot in the toilet).","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009339_100.jpg","ruTranscript":"Тогда Писториус сказал, что до него дошло: это могла быть Рива (человек, застрелянный в туалете).","ruDescription":"Стать понятным; быть неожиданно осознанным."},{"vimeoId":"88520976","title":"to dawn on someone","description":"\"Dawn on someone\":  to become apparent to someone; [for something] to be suddenly realized by someone.","transcript":"Then it dawned on me: it was going to be here on the threshold, my own threshold (about the ABBA museum).","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009342_100.jpg","ruTranscript":"И тогда до меня дошло: это будет здесь, на пороге, на моем пороге (о музее группы АББА).","ruDescription":"Стать понятным; быть неожиданно осознанным."},{"vimeoId":"88520990","title":"to dawn on someone","description":"\"Dawn on someone\":  to become apparent to someone; [for something] to be suddenly realized by someone.","transcript":"When I want to bed after having won the Eurovision song contest in 1974... and it dawned on me that Ok yesterday we were this little group from Sweden and now one day later the whole world is absolutely open.","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009350_100.jpg","ruTranscript":"Евровидение-1974… И вдруг до меня дошло: да, вчера мы были неизвестной группой из Швеции, а сегодня весь мир открыт для нас.","ruDescription":"Стать понятным; быть неожиданно осознанным."},{"vimeoId":"95783732","title":"to do 180","description":"\"To do 180\": also \"to do one eighty\", \"U-turn\". A complete reversion of course (course of actions or actual direction of vehicle).","transcript":"So Sanjay, I know you've done 180 on medical marijuana but you are really now all-in. You're actually in the grow room.","imgSrc":"http://i.vimeocdn.com/video/475767313_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783765","title":"to drive a wedge","description":"\"To drive a wedge between somebodies\": to do something which spoils their relationship. ","transcript":"The 21 members of European Union are united, the 21 members of NATO are united, so if anyone in Russian leadership thought the world wouldn't care about their actions in Ukraine or that they could drive the wedge between the European Union and the United States, they clearly miscalculated.","imgSrc":"http://i.vimeocdn.com/video/475767341_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053170","title":"to drop in","description":"\"To drop in\": to pay a casual visit; to visit briefly.","transcript":"I tore my mind on a jagged sky, I just dropped in to see what condition my condition was in.","imgSrc":"http://i.vimeocdn.com/video/472988577_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783796","title":"to dust off","description":"\"To dust off\": to restore to use.","transcript":"There was a the Arab Summit last week in Riyadh where leaders dusted off a five-year-old comprehensive peace plan.","imgSrc":"http://i.vimeocdn.com/video/475767447_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783817","title":"to face","description":"\"To face something\": to acknowledge something, to accept something.","transcript":"And let's face it: if anywhere can make dreams come true, well, Silicon valley has a pretty good track record.","imgSrc":"http://i.vimeocdn.com/video/475767459_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783852","title":"to fall off the wagon","description":"\"To fall off the wagon\": to resume an addiction overcomed in the past; to start drinking again or taking drugs, et cetera.","transcript":"He had suffered in the past from problems with drug addiction and spoke recently of falling off the wagon after 23 years of being clean.","imgSrc":"http://i.vimeocdn.com/video/475767481_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89277049","title":"to fan out","description":"\"To fan out\": to spread out over a wide area.","transcript":"The second truck of Russians moves in, its soldiers fanning out.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957816_100.jpg","ruTranscript":"Подъезжает второй грузовик с российскими солдатами, солдаты расследотачиваются.","ruDescription":"Рассредоточиться на большой территории."},{"vimeoId":"93053187","title":"to faze","description":"\"To faze\": to shock someone; to make someone lose composure.","transcript":"The baby prince wasn't fazed and natural in front of the cameras.","imgSrc":"http://i.vimeocdn.com/video/472988641_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053178","title":"to faze","description":"\"To faze\": to shock someone; to make someone lose composure.","transcript":"- I know nothing fazes you but this should faze you: we're completely in the dark on this! - That's a relief.","imgSrc":"http://i.vimeocdn.com/video/472988646_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88091515","title":"to fire at will","description":"Coming from the authority directly above you in the chain of command, this simply allows the individual to choose his rate of fire and prefered style, whether open or snipe etc.","transcript":"Having abandoned their positions they seem to be firing at will.","imgSrc":"http://i.vimeocdn.com/video/466407439_100x75.jpg","ruTranscript":"Оставив свои посты, они открыли беглый огонь.","ruDescription":"Приказ от командира стрелять в любом темпе и положении."},{"vimeoId":"88520995","title":"to flex muscles","description":"\"To flex your/its muscles\" is to act in a way that shows power or strength.","transcript":"So what...Putin is on today in a way backed off slightly but kept the muscles flexing on the table.","imgSrc":"http://b.vimeocdn.com/ts/467/009/467009375_100.jpg","ruTranscript":"Ну и что… Сегодня Путин чуть отступил, но все же продолжил демонстрировать силу.","ruDescription":"Показывать мощь или силу."},{"vimeoId":"95783875","title":"to get away with","description":"\"To get away with something\": not to get punished for doing something; to escape the consequences of doing something.","transcript":"Let me be clear: without the proper cop on the beat the roads are not safe and wrong-doers will get away with whatever mischief they can.","imgSrc":"http://i.vimeocdn.com/video/475767494_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89277068","title":"to get away with something","description":"\"To get away with something\": to avoid blame, punishment, or criticism for doing something bad","transcript":"Let me be clear: without a proper cop on the beat the roads are not safe and wrongdoers will get away with whatever mischief they can. Please find info about the \"cop on the beat\" in our library.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957869_100.jpg","ruTranscript":"Необходимо понять: без хорошего полицейского в районе дороги небезопасны, и правонарушители уйдут безнаказанными после всего, что натворят. Пожалуйста, ознакомьтесь с идиомой \"cop on the beat\" в нашей коллекции.","ruDescription":"Избежать обвинения, наказания или критики."},{"vimeoId":"89277082","title":"to get away with something","description":"\"To get away with something\": to avoid blame, punishment, or criticism for doing something bad","transcript":"And that's true. Think about what it means: the mob killed their President and they got away with it.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957873_100.jpg","ruTranscript":"И это правда. Подумайте о том, что это значит: мафиози убили своего президента им это сошло с рук.","ruDescription":"Избежать обвинения, наказания или критики."},{"vimeoId":"87408875","title":"to get in the way","description":"To \"get in the way\" of something is to prevent something from happening.","transcript":"Accountants only slow things down. Figures get in the way.","imgSrc":"http://b.vimeocdn.com/ts/465/454/465454893_100.jpg","ruTranscript":"Бухгалтеры только тормозят процесс. Цифры мешают.","ruDescription":"Сделать так, чтобы что-то не произошло."},{"vimeoId":"87408847","title":"to get in the way","description":"To \"get in the way\" of something is to prevent something from happening.","transcript":"It's measured by the billions of dollars so I don't think you gonna see ah... the cyber security issue get in the way of that.","imgSrc":"http://b.vimeocdn.com/ts/465/454/465454884_100.jpg","ruTranscript":"Это измеряется миллиардами долларов, поэтому я не думаю, что интернет-безопасность станет проблемой.","ruDescription":"Сделать так, чтобы что-то не произошло."},{"vimeoId":"87408890","title":"to get in the way","description":"To \"get in the way\" of something is to prevent something from happening.","transcript":"... the politics getting in the way of getting a resourse from beneath the ground to above the ground.","imgSrc":"http://b.vimeocdn.com/ts/465/454/465454904_100.jpg","ruTranscript":"…политика, которая встает на пути у добычи ресурсов из недр и их доставки на поверхность.","ruDescription":"Сделать так, чтобы что-то не произошло."},{"vimeoId":"93053196","title":"to get rid of","description":"\"To get rid of something/someone\": to stop using this \"something\"; to throw away this \"something\".","transcript":"Here in the Spain we have had the dictatorship of Franco for forty years. We suffered from dictatorship like that but we think it wouldn't have been a good idea  to bomb Madrid or Barcelona to get rid of Franco","imgSrc":"http://i.vimeocdn.com/video/472988643_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053204","title":"to give somebody a dirty look","description":"\"To give a dirty look\": to look at someone in an angry way.","transcript":"... and threaten to shoot anyone who give someone a dirty look or use his harsh language.","imgSrc":"http://i.vimeocdn.com/video/472988656_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89511060","title":"to go back to the drawing board","description":"\"To go back to the drawing board\":to return to the planning stage, so that a failed project can be planned again. ","transcript":"Discovery world is going back to the drawing board, to the golden age of car design.","imgSrc":"http://b.vimeocdn.com/ts/468/286/468286622_100.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89498285","title":"to go fishing","description":"\"Gone fishing\" is an idiom that is used in reference to someone who is completely unaware of all that is going on in his immediate surroundings. The person described in this manner has checked out from reality and may be daydreaming.","transcript":"The title was \"Bin Laden determined to attack inside the United States\". A report like that might make some men jump, but as in days passed, George W. just went fishing.","imgSrc":"http://b.vimeocdn.com/ts/468/270/468270401_100.jpg","ruTranscript":"Заголовок был такой: \"Бин Ладен намерен атаковать США внутри страны\". Некоторые люди от такого доклада подскочили бы, но Джордж Буш младший как будто вообще не понял, что произошло.","ruDescription":"Совсем не понимать того, что происходит вокруг; быть оторванным от реальности; грезить."},{"vimeoId":"93053397","title":"to go from bad to worse","description":"\"To go from bad to worse\": to became even worse than before.","transcript":"It went from bad to worse for William when there was a problem with his spinnaker sail and it came worryingly close to some rocks.","imgSrc":"http://i.vimeocdn.com/video/472988933_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88525352","title":"to grasp at straws","description":"\"To grasp at straws\": to try any method, even those that are not likely to succeed, because you are in such a bad situation; to try to find reasons to feel hopeful about a situation when there is no real cause for hope.","transcript":"If I'm gone by the time you get back, or this is just me grasping at straws... I just want you to know I'm not scared.","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014720_100.jpg","ruTranscript":"Если когда ты вернешься меня не будет, или если я буду держаться из последних сил, знай - я не боюсь.","ruDescription":"Применять любой способ, даже сомнительный, поскольку человек находится в бедственном положении; пытаться обнадежить себя, когда надеяться не на что."},{"vimeoId":"87408937","title":"to have a ball","description":"To \"have a ball\" is to have an exciting time, to enjoy yourself very much.","transcript":"Bye-bye. Backs to the wall. Aim high. We're having a ball. That's how we get the government we deserve.","imgSrc":"http://b.vimeocdn.com/ts/465/454/465454997_100.jpg","ruTranscript":"Пока-пока. Спиной к стене. Целься выше. Мы развлекаемся. Вот как у нас появится правительство, которое мы заслуживаем.","ruDescription":"Интересно проводить время, получая при этом большое удовольствие."},{"vimeoId":"87408970","title":"to have a ball","description":"To \"have a ball\" is to have an exciting time, to enjoy yourself very much.","transcript":"In my dreams I have a plan, if I got me a wealthy man, I wouldn't have to work at all, I'd fool around and have a ball.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455027_100.jpg","ruTranscript":"Я мечтаю о том, чтобы найти себе богатого мужчину, не работать совсем и просто изменять ему направо и налево и брать от жизни все.","ruDescription":"Интересно проводить время, получая при этом большое удовольствие."},{"vimeoId":"87951125","title":"to have a bone to pick with someone","description":"\"to have a bone to pick with someone\" is to  have a reason to be angry with a person.","transcript":"- Bruce, I got a bone to pick with you! - You do? - Yep! - Why?","imgSrc":"http://b.vimeocdn.com/ts/466/215/466215888_100.jpg","ruTranscript":"- Брюс, ты разозлил меня! - Правда? - Ага! - Чем?","ruDescription":"Иметь причину злиться на кого-либо."},{"vimeoId":"89277090","title":"to have a field day","description":"\"To have a field day\":to experience freedom from one's usual work schedule; to have a very enjoyable time.","transcript":"\"No to war!\" is everywhere: restaurants print it on receits, even the news stand man wears the badge. The newspapers are having a field day criticising the government.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957880_100.jpg","ruTranscript":"Слоган \"Нет войне\" повсюду: рестораны печатают его на чеках, даже продавец газет носит такой значок. Газеты насладжаются возможностью раскритиковать правительство.","ruDescription":"Выйти из своего рабочего графика; провести время с удовольствием."},{"vimeoId":"93053416","title":"to have fingers crossed","description":"\"To have fingers crossed\": to wish for luck .","transcript":"﻿But my application is strong this year: a letter of condemnation of deputy major! That's gonna have some weight, so… fingers crossed.","imgSrc":"http://i.vimeocdn.com/video/472988951_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053407","title":"to have fingers crossed","description":"\"To have fingers crossed\": to wish for luck .","transcript":"﻿My fingers… I have my finger crossed for that. Well, I think everybody listening to you will have their fingers crossed for you.","imgSrc":"http://i.vimeocdn.com/video/472988946_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053431","title":"to have guts","description":"\"To have guts\" :to have willpower and courage to do something.","transcript":"West has no guts, no instrument to punish Russia.","imgSrc":"http://i.vimeocdn.com/video/472988960_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88092279","title":"to have one's ear","description":"If someone \"has the ear\" of an important person, their ideas are listened to and considered important by that person.","transcript":"There is no \"ear\" idiom in this phrase. However, you can see it on the screen.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408553_100.jpg","ruTranscript":"В этом сюжете не использована данная идиома. Однако, вы можете видеть ее на экране.","ruDescription":"Иметь влияние."},{"vimeoId":"88092222","title":"to have one's ear","description":"If someone \"has the ear\" of an important person, their ideas are listened to and considered important by that person.","transcript":"Right, he has the ear of President Bashar al-Assad.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408396_100.jpg","ruTranscript":"Да, он имеет влияние на президента Башара Асада.","ruDescription":"Иметь влияние."},{"vimeoId":"88092250","title":"to have one's ear","description":"If someone \"has the ear\" of an important person, their ideas are listened to and considered important by that person.","transcript":"\"You know, he has had Steve Jobs's ear, he's been really been running the show behind the scenes for quite some time\". Please find info about other two idioms used in this video in our library.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408434_100.jpg","ruTranscript":"\"Вы знаете, что он имел влияние на Стива Джобса и на самом деле какое-то время он был главным, незаметно для всех\". Пожалуйста, ознакомьтесь с значением двух других идиом, использованных в этом фрагменте, в нашей коллекции.","ruDescription":"Иметь влияние."},{"vimeoId":"88092197","title":"to have one's ear","description":"If someone \"has the ear\" of an important person, their ideas are listened to and considered important by that person.","transcript":"She's most often the person on the backdrop, constantly at the side of Hillary Clinton and a person who has her ear.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408394_100.jpg","ruTranscript":"Чаще всего она стоит позади, постоянно находясь рядом с Хиллари Клинтон и, по-видимому, имея на нее определенное влияние.","ruDescription":"Иметь влияние."},{"vimeoId":"89511155","title":"to hear something on the grapevine","description":"\"To hear something on the grapevine\": to hear news from someone who heard the news from someone else.","transcript":"I heard it on the grapevine, straight from the horse's mouth. They're saying on the grapevine that he's heading north and you're going south.","imgSrc":"http://b.vimeocdn.com/ts/468/286/468286733_100.jpg","ruTranscript":"Я слышала от тех, кому поведали те, кто знает точно. Говорят, что он держит путь север, а ты идешь на юг.","ruDescription":"Узнать что-либо от кого-то, кто также получил эти сведения от кого-либо."},{"vimeoId":"95783913","title":"to hold the key","description":"\"To hold the key\":  to have control of something; to provide the explanation for something that you could not previously understand.","transcript":"Jayalalithaa - she's a former actress and the most formidable Tamil politician today. A strong showing from Monday's polls and she could well hold the key to the next government.","imgSrc":"http://i.vimeocdn.com/video/475767558_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89277102","title":"to hone in on something","description":"\"To hone in on something\": to give all your attention to something, to focus.","transcript":"Yeah, Anderson, that's right, that's certainly what's fueling the fire and  this case what you're seeing is people sort of honing in on the irregularities.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957893_100.jpg","ruTranscript":"Да, Андерсон, правильно, это именно то, что подливает масла в огонь, и люди, которых ты видишь, специализируются на подобного рода беспорядках.","ruDescription":"Сосредоточить все свое внимание на чем-либо; сфокусироваться."},{"vimeoId":"93053447","title":"to join the dots","description":"\"To join the dots\": to get the whole picture; to bring together all separated facts.","transcript":"\"How important do you believe it is for the families? They've had this conclusion based on, you know,  the joining the dots of satellite data\" ...","imgSrc":"http://i.vimeocdn.com/video/472989007_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89277114","title":"to join the ranks","description":"\"To join the ranks\" of something: to become part of a larger group or organization","transcript":"This vast city is now the porn capital of the world. Shoko is one of thousands of young Japanese women who every year flock to join its ranks.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957903_100.jpg","ruTranscript":"Этот огромный город сейчас является порностолицей всего мира. Шоко - одна из тысяч японских девушек, которые приезжают сюда пополнить ряды работников индустрии.","ruDescription":"Становиться частью группы или организации."},{"vimeoId":"93053459","title":"to keep an eye on","description":"\"To keep an eye on something: to watch (monitor) something.","transcript":"the authorities will be keeping an eye on this and certainly be trying to help those people who are trying to evacuate","imgSrc":"http://i.vimeocdn.com/video/472989010_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88092384","title":"to keep at bay","description":"\"To keep something at bay\" is to prevent something or someone unpleasant from coming too near you or harming you;  to prevent someone from moving closer .","transcript":"Israeli aircraft were kept at bay by surface-to-air missiles.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408618_100.jpg","ruTranscript":"Ракеты класса \"Земля-Воздух\" не подпускали израильскую авиацию.","ruDescription":"Не допустить, чтобы кто-либо или что-либо плохое коснулось вас или причинило вам вред; не подпускать кого-либо близко."},{"vimeoId":"89277117","title":"to keep at bay","description":"\"To keep something at bay\" is to prevent something or someone unpleasant from coming too near you or harming you;  to prevent someone from moving closer .","transcript":"...patrols the island several times keeping humans at bay and looking for plastic and other hazards to wildlife.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957908_100.jpg","ruTranscript":"…патрулирует остров по нескольку раз, не подпуская людей, и пытаясь найти пластмассу и другие вещества, способные навредить природе.","ruDescription":"Не допустить, чтобы кто-либо или что-либо плохое коснулось вас или причинило вам вред; не подпускать кого-либо близко."},{"vimeoId":"89277127","title":"to keep at bay","description":"\"To keep something at bay\" is to prevent something or someone unpleasant from coming too near you or harming you;  to prevent someone from moving closer .","transcript":"...he is the only one capable of keeping extemists at bay.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957911_100.jpg","ruTranscript":"Он - единственный, кто может сдержать экстремистов.","ruDescription":"Не допустить, чтобы кто-либо или что-либо плохое коснулось вас или причинило вам вред; не подпускать кого-либо близко."},{"vimeoId":"88092358","title":"to keep at bay","description":"\"To keep something at bay\" is to prevent something or someone unpleasant from coming too near you or harming you;  to prevent someone from moving closer .","transcript":"Michelle Recart is a rebel who challenged the old rules that kept women at bay. Now she's a first lady of  Chilean rodeo.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408581_100.jpg","ruTranscript":"Мишель Рекарт - мятежница , которая выступила старых обычаев, ограничивающих женщин. Сейчас она первая женщина-участница чилийского родео.","ruDescription":"Не допустить, чтобы кто-либо или что-либо плохое коснулось вас или причинило вам вред; не подпускать кого-либо близко."},{"vimeoId":"88092298","title":"to keep at bay","description":"\"To keep something at bay\" is to prevent something or someone unpleasant from coming too near you or harming you;  to prevent someone from moving closer .","transcript":"They allowed the protesters to come and go and they kept pro-Mubarak attackers at bay.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408470_100.jpg","ruTranscript":"Они позволили протестующим делать что вздумается, но сторонников Мубарака держали под контролем.","ruDescription":"Не допустить, чтобы кто-либо или что-либо плохое коснулось вас или причинило вам вред; не подпускать кого-либо близко."},{"vimeoId":"88092335","title":"to keep at bay","description":"\"To keep something at bay\" is to prevent something or someone unpleasant from coming too near you or harming you;  to prevent someone from moving closer .","transcript":"Even with no tools or weapons Mike knows how to find much needed protein to add to his fruit diet and keep starvation at bay.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408582_100.jpg","ruTranscript":"Даже без инструментов или оружия Майк может добыть столь необходимый белок и добавить его в свой фруктовый рацион, чтобы избежать голодной смерти.","ruDescription":"Не допустить, чтобы кто-либо или что-либо плохое коснулось вас или причинило вам вред; не подпускать кого-либо близко."},{"vimeoId":"93053486","title":"to keep fingers crossed","description":"\"To have fingers crossed\": to wish for luck.","transcript":"﻿But my application is strong this year: a letter of condemnation from the deputy major! That's gonna have some weight, so… fingers crossed.","imgSrc":"http://i.vimeocdn.com/video/472989020_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053470","title":"to keep fingers crossed","description":"\"To have fingers crossed\": to wish for luck.","transcript":"My fingers… I have my fingers crossed for that. Well, I think everybody listening to you will have their fingers crossed for you","imgSrc":"http://i.vimeocdn.com/video/472989023_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87409000","title":"to keep the books","description":"The idiom \"to keep the books\" means to make records of profits, losses and expenditures for a business.","transcript":"When the money keeps rolling out you don't keep books.You can tell you've done well by the happy, grateful looks. Accountants only slow things down. Figures get in the way...","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455042_100.jpg","ruTranscript":"Когда деньги текут рекой, ты не ведешь записей о доходах и расходах. И можно понять, что ты был хорош по счастливым и благодарным взглядам. Бухгалтеры лишь тормозят процесс. Цифры мешают...","ruDescription":"Записывать сведения о доходах, убытках и расходах бизнеса."},{"vimeoId":"93053492","title":"to kick in","description":"\"To kick in\": to take effect, to become operative.","transcript":"We did what we were trained to do, it just kicked in.","imgSrc":"http://i.vimeocdn.com/video/472989026_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88091713","title":"to kick the tyres","description":"\"To kick the tires\" means to try something or examine it carefully before you buy it;  it is sometimes used in a more figurative sense to simply mean superficially check of the quality of something.","transcript":"- Is it a genuine offer or when you look at it,is it a stalling tactic? - We'll have to kick the tyres, obviously.","imgSrc":"http://i.vimeocdn.com/video/466407636_100x75.jpg","ruTranscript":"- Это искреннее предложение или же тактический ход? - Нам нужно будет это проверить, конечно.","ruDescription":"Протестировать или детально осмотреть что-либо перед покупкой либо поверхностно проверить качество чего-либо."},{"vimeoId":"88091684","title":"to kick the tyres","description":"\"To kick the tires\" means to try something or examine it carefully before you buy it;  it is sometimes used in a more figurative sense to simply mean superficially check of the quality of something.","transcript":"Audiences kick tyres to see how presenters stands in the line of fire, investors kick the tyres to see how the management responds to adversity, and employers kick the tyres of perspective employees to test their grip.","imgSrc":"http://i.vimeocdn.com/video/466407619_100x75.jpg","ruTranscript":"Зрительный зал проверяет то, как выступающий держится на сцене, инвесторы проверяют то, как управляющие ведут себя в трудных ситуациях, а работодатели проверяют хватку своих будущих подчиненных.","ruDescription":"Протестировать или детально осмотреть что-либо перед покупкой либо поверхностно проверить качество чего-либо."},{"vimeoId":"88525359","title":"to kiss and tell","description":"“To kiss and tell”: to talk on television, in a newspaper etc. about a sexual relationship you have had with a famous person, especially in order to get a lot of money.","transcript":"Her actions are unique in history of mistresses of prominent men. A far more common route to revenge is kiss and tell.","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014789_100.jpg","ruTranscript":"Её действия были необычными для любовницы известных мужчин. Более распространенным способом отомстить является освещение этих отношений в прессе.","ruDescription":"Опубликовать сведения о своих интимных связях с известной личностью, в основном с целью заработать на этом деньги."},{"vimeoId":"95783937","title":"to leave no stone unturned","description":"\"To leave no stone unturned\": to search in all possible and couple of impossible places; to make every possible effort.","transcript":"That investigators leave no stone unturned. They dig to the bottom of the ocean to make sure that flying remains the safest form of travel (which it is today)","imgSrc":"http://i.vimeocdn.com/video/475767595_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89511223","title":"to lie back and think of England","description":"\"Lie back and think of England\": advice given when a woman will inevitably be taking part in unwanted but inevitable sex,  usually with a partner but sometimes attributed to rape. Mothers would give it to their daughters on their wedding nights: think of the good the children could do the country.","transcript":"On that low note, it's time for Beverly to glove up, stand firm and think of England. So you take the tail with your left hand  and lift the tail up. You're heading for that top opening. Curl with your hand, twist slightly and push. ","imgSrc":"http://i.vimeocdn.com/video/468286778_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89511252","title":"to lie back and think of England","description":"\"Lie back and think of England\": advice given when a woman will inevitably be taking part in unwanted but inevitable sex,  usually with a partner but sometimes attributed to rape. Mothers would give it to their daughters on their wedding nights: think of the good the children could do the country.","transcript":"That's right,love! For centuries the Farnsworth gentleman has provided service to the Queen. Now close your eyes and think of England!","imgSrc":"http://i.vimeocdn.com/video/468286819_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95783976","title":"to lie in state","description":"\"To lie in state\": to be on display for public mourning (for dead body).","transcript":"Underneath the golden domes of the Russian orthodox Christ the Savior Cathedral in the center of the Russian capital Boris Eltsyn's body has been lying in state.","imgSrc":"http://i.vimeocdn.com/video/475767622_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784031","title":"to lie in state","description":"\"To lie in state\": to be on display for public mourning (for dead body).","transcript":"Tens of thouthands of people are continuing to fill the streets surround the Vatican queueing to see the body of Pope John Paul II lying in state.","imgSrc":"http://i.vimeocdn.com/video/475767743_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784000","title":"to lie in state","description":"\"To lie in state\": to be on display for public mourning (for dead body).","transcript":"We saw a televised image of the Pope's body lying privately in state in the Apostolic Palace. It will be moved tomorrow to the Basilica of St. Peter so that pilgrims can have a chance to come and say the last goodbyes.","imgSrc":"http://i.vimeocdn.com/video/475767633_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784053","title":"to live up to","description":"\"To live up to something\": to live or act in accordance with something.","transcript":"A county that lives up to it's legacy as the global leader in technology, in discovery, in innovation with all the new jobs and new businesses that follow.","imgSrc":"http://i.vimeocdn.com/video/475767751_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784080","title":"to live up to","description":"\"To live up to something\": to live or act in accordance with something.","transcript":"And you made clear that if you use them you either have to live up to diplomacy or there is actual punishment.","imgSrc":"http://i.vimeocdn.com/video/475767767_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784109","title":"to lock and load","description":"\"To lock and load\": short for locking the magazine(cartridge) into the gun and loading the ammunition into the gun's chamber; preparations have to be made for an immediate action (as if to fire).","transcript":"…is ready to lock and load for more guns in more places. So where does the right to bear arms end and the duty to bar them begin?","imgSrc":"http://i.vimeocdn.com/video/475767800_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784130","title":"to make a dent in","description":"\"To make a dent in something\": to make a small amount of progress with something.","transcript":"I want this place to be spotless and you barely made a dent in the clutter!","imgSrc":"http://i.vimeocdn.com/video/475767850_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784154","title":"to make a difference","description":"\"To make a difference\": to have an effect; to distinguish.","transcript":"There is a difference between making cars and making cars that make a difference.","imgSrc":"http://i.vimeocdn.com/video/475767846_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784193","title":"to make ends meet","description":"\"To make (both) ends meet\": to make very little money just enough to cover basic needs.","transcript":"The Swaziland grandmothers growing potent marijuana to make ends meet.","imgSrc":"http://i.vimeocdn.com/video/475767883_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784167","title":"to make ends meet","description":"\"To make (both) ends meet\": to make very little money just enough to cover basic needs.","transcript":"Writing to \"New York Times\" on Monday Buffet says, quote, \"While the poor and middle class fight for us in Afghanistan, and while most Americans struggle to make ends meet, we mega-rich continue to get our extraordinary tax breaks\".","imgSrc":"http://i.vimeocdn.com/video/475767871_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053505","title":"to make matters worse","description":"\"To make matters worse\": to make the situation even more unpleasant or difficult (even worse that before). ","transcript":"Today after a grueling four hours the hunters catch only three small birds. Making matters worse the Hadza face severe competition for land and water from livestock herders","imgSrc":"http://i.vimeocdn.com/video/472989040_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89511280","title":"to mothball","description":" \"To mothball\": to stop work on an idea, plan, or job, but leaving it in such a way that you can start on it again  at some point in the future","transcript":"Russians actually scuttled an old mothballed, I think, a cruiser to block the entrance and block some ships inside. ","imgSrc":"http://i.vimeocdn.com/video/468286889_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95782058","title":"To play catch-up","description":"\"To play catch-up\": to make a special effort to overcome a late start or the advantage a competitor has. ","transcript":"It's moved away from the crash site, it's moved away maybe 52 or 150 miles by now. It's dispersed as well. It's joining the background of other debris. Leaving search teams to play catch up as they try to track down flight 370.","imgSrc":"http://i.vimeocdn.com/video/475765313_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784219","title":"to pull out all the stops","description":"\"To pull out all the stops\": to do everything you can to make something successful. ","transcript":"America's gun lobby pulled out all the stops at it's annual convention this weekend. The NRA continues to resist even the kind of sensible gun control that the overwhelming majority of the American people support.","imgSrc":"http://i.vimeocdn.com/video/475768014_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784254","title":"to put through","description":"\"To put somebody through something\": to unintentionally cause someone to experience something unpleasant.","transcript":"I'm sorry, Twilight, to have to put you all through so much trouble. Trouble, huh? What trouble?","imgSrc":"http://i.vimeocdn.com/video/475768016_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784292","title":"to raise eyebrows","description":"\"To raise eyebrows\": to show surprise.","transcript":"He spent 42 million dollars renovating his home and also raised eyebrows for flying first class to India for a missionary trip.","imgSrc":"http://i.vimeocdn.com/video/475768039_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784320","title":"to rub shoulders","description":"\"To rub shoulders\": to interact closely; to mix.","transcript":"It was also a day of odd couples: Beyonce and Jay Z rubbing shoulders with Newt Gingrich and Callista.","imgSrc":"http://i.vimeocdn.com/video/475768064_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88092477","title":"to run the show","description":"\"To run the show\" is to be in charge; to be in command.","transcript":"\"You know, he has had Steve Jobs's ear,he's been really been running the show behind the scenes for quite some time\". Please find info about other two idioms used in this video in our library.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408735_100.jpg","ruTranscript":"\"Вы знаете, что он имел влияние на Стива Джобса и на самом деле какое-то время он был главным, незаметно для всех\". Пожалуйста, ознакомьтесь с значением двух других идиом, использованных в этом фрагменте, в нашей коллекции.","ruDescription":"Быть главным."},{"vimeoId":"90555105","title":"to show somebody the ropes","description":"\"To show somebody the ropes\": to explain to someone how to do a job or activity.   This expression has its origins in the world of sailing.","transcript":"Good morning! Vet surgeon Sarah Bailey is here to show us the ropes. Shes an inventor as well as a vet. ","imgSrc":"http://i.vimeocdn.com/video/469745376_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784341","title":"to speak volumes","description":"\"To speak volumes\": to reveal a massive amount of information.","transcript":"The destruction speaks volumes about the intensity of the blaze.","imgSrc":"http://i.vimeocdn.com/video/475768105_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784367","title":"to spill the beans","description":"\"To spill the beans\":  to disclose a secret.","transcript":"It was supposed to be a secret Israeli raid in the West Bank but someone spilled the beans on a social networking site. Find out who leaked the details and how.","imgSrc":"http://i.vimeocdn.com/video/475768146_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784410","title":"to spirit away","description":"\"To spirit away\": to sneak something or someone away to another place.","transcript":"These people were brought here as children spirited away from another journey: a journey which took jewish families to their deaths in the concentration camps.","imgSrc":"http://i.vimeocdn.com/video/475768148_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784478","title":"to spirit away","description":"\"To spirit away\": to sneak something or someone away to another place.","transcript":"Some of Spain's top toreros are on the bill for the final fight here. Tickets sold out at record speed, even street posters have been torn down and spirited away as souvenirs.","imgSrc":"http://i.vimeocdn.com/video/475768261_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784437","title":"to spirit away","description":"\"To spirit away\": to sneak something or someone away to another place.","transcript":"Those documents were actually spirited away to safety!","imgSrc":"http://i.vimeocdn.com/video/475768162_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"90555085","title":"to spit it out","description":"\"Spit it out!\": trying to get someone to tell you their secret; can also be used if person is stuttering.","transcript":"- Can I ask you something?  - If it is for a date, I'm sorry, I've never seen anyone under 65, too much trauma. Come on, spit it out.","imgSrc":"http://i.vimeocdn.com/video/469745187_100x75.jpg","ruTranscript":"- Можно спросить? - Если хочешь позвать на свидание, прости, я никогда не встречалась ни с кем моложе 65 - эмоциональная травма. Давай, выкладывай.","ruDescription":"Используется, когда пытаются выпытать какой-либо секрет; также используется в отношении заикающегося человека."},{"vimeoId":"95784499","title":"to stay put","description":"\"To stay put\": not to change location; to stand where you are.","transcript":"Jack, thank you very much for joining us. You're a brave man, just explain to us why you decided to stay put. If the storm was to strike again, would you stay put?","imgSrc":"http://i.vimeocdn.com/video/475768290_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784525","title":"to stay put","description":"\"To stay put\": not to change location; to stand where you are.","transcript":"Bad as they are, banks are better than trains. They don't move, they stay put, you know the money's in there.","imgSrc":"http://i.vimeocdn.com/video/475768300_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784549","title":"to strut stuff","description":"\"To strut one's stuff\": to swagger; to walk proudly and show off one's best features or talents.","transcript":"And now the so called \"ships of the desert\" have their chance to complete the image as they strut their stuff in front of the admiring crowd.","imgSrc":"http://i.vimeocdn.com/video/475768308_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784627","title":"to take for granted","description":"\"To take something for granted\": to assume that something is available for free and forever and you don't need to earn it; to fail to appreciate the value of something.","transcript":"And while we must never take this for granted, the first purpose of the European Union — to secure peace — has been achieved.","imgSrc":"http://i.vimeocdn.com/video/475768408_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784601","title":"to take for granted","description":"\"To take something for granted\": to assume that something is available for free and forever and you don't need to earn it; to fail to appreciate the value of something.","transcript":"…but we're not… we're not taking anything for granted…","imgSrc":"http://i.vimeocdn.com/video/475768394_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784577","title":"to take for granted","description":"\"To take something for granted\": to assume that something is available for free and forever and you don't need to earn it; to fail to appreciate the value of something.","transcript":"I'm voting, I'm going to work tomorrow… Going to work, casting a vote: things many take for granted. But not here","imgSrc":"http://i.vimeocdn.com/video/475768359_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784648","title":"to take heed","description":"\"To take heed\": to be careful.","transcript":"Officials had urged residents to follow evacuation orders in low-line areas. Most took heed but not everyone was listening.","imgSrc":"http://i.vimeocdn.com/video/475768417_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784692","title":"to take on","description":"\"To take on\": to deal with; to begin to handle.","transcript":"Michael Bloomberg, who's the former mayor of New York, has announced money and plans to launch a rival lobby to take on the NRA.","imgSrc":"http://i.vimeocdn.com/video/475768546_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784674","title":"to take on","description":"\"To take on\": to deal with; to begin to handle.","transcript":"On the high seas sailors gonna had to take on modern day pirates complete with rocket launchers and AK-47.","imgSrc":"http://i.vimeocdn.com/video/475768530_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88525376","title":"to the hilt","description":"\"To the hilt\" means to the limit; completely.","transcript":"Ah...that they're going to isolate Russia saying saying, quote \"they wanna go to the hilt to isolate Russia economically\".","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014802_100.jpg","ruTranscript":"Они собираются изолировать Россию, говоря, цитата: \"Они хотят полностью экономически изолировать Россию\".","ruDescription":"До конца; полностью."},{"vimeoId":"93053213","title":"to try your hand at something","description":"\"To try your hand at something\": to try doing something for the first time.","transcript":"But would this accident have happened if he'd been on the bridge and if  (as emerged today) the helmsman hadn't let a 25 years old crew member  try her hand at steering the ship.","imgSrc":"http://i.vimeocdn.com/video/472988680_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87409303","title":"to turn blind eye","description":"To \"turn a blind eye\" (to someone or something)is to ignore something and pretend you do not see it.","transcript":"Turn a blind eye, Evita. Turn a blind eye.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455500_100.jpg","ruTranscript":"Не обращай внимания, Эвита. Не обращай внимания.","ruDescription":"Игнорировать что-либо и делать вид, что не замечаешь этого."},{"vimeoId":"87409274","title":"to turn blind eye","description":"To \"turn a blind eye\" (to someone or something)is to ignore something and pretend you do not see it.","transcript":"...the frightening battles between Egyptians on the streets outside the Presidential Palace and  seeing the current government turn a blind eye I took the decision to resign.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455494_100.jpg","ruTranscript":"…ужасающие столкновения египтян на улицах, за пределами дворца президента и то, что нынешнее правительство закрывает на это глаза, побудило меня уйти в отставку.","ruDescription":"Игнорировать что-либо и делать вид, что не замечаешь этого."},{"vimeoId":"87409344","title":"to turn blind eye","description":"To \"turn a blind eye\" (to someone or something)is to ignore something and pretend you do not see it.","transcript":"These elections are the real test for Azerbajan and the West.  The question is if they're not fair will the West respond or will it turn a blind eye?","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455556_100.jpg","ruTranscript":"Эти выборы - истинное испытание для Азербайджана и Запада. Вопрос вот в чем: если выборы будут нечестными, то отреагирует ли на это Запад или же закроет на это глаза?","ruDescription":"Игнорировать что-либо и делать вид, что не замечаешь этого."},{"vimeoId":"87409320","title":"to turn blind eye","description":"To \"turn a blind eye\" (to someone or something)is to ignore something and pretend you do not see it.","transcript":"Is child labor still acceptable for some multinationals? Or finally can they no longer turn a blind eye as to where their raw products actually come from.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455508_100.jpg","ruTranscript":"Приемлем ли до сих пор детский труд для деятельности международных компаний? Или же они наконец не могут закрывать глаза на то, откуда берется их сырье.","ruDescription":"Игнорировать что-либо и делать вид, что не замечаешь этого."},{"vimeoId":"87409238","title":"to turn blind eye","description":"To \"turn a blind eye\" (to someone or something)is to ignore something and pretend you do not see it.","transcript":"Police spokesman Christos Manouras said he would investigate any video which suggested officers turned a blind eye that night.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455407_100.jpg","ruTranscript":"Представитель полиции Кристос Манурес заявил, что изучит любое видео, на котором офицеры полиции игнорируют происшествия той ночи.","ruDescription":"Игнорировать что-либо и делать вид, что не замечаешь этого."},{"vimeoId":"87409256","title":"to turn blind eye","description":"To \"turn a blind eye\" (to someone or something)is to ignore something and pretend you do not see it.","transcript":"He emphasized the moral reasons for getting involved saying history would judge the US if it turns a blind eye to what was happening (J.Kerry about Syria)","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455395_100.jpg","ruTranscript":"Он сделал акцент на моральных причинах интервенции, говоря, что история осудит Америку, если та закроет глаза на то, что происходит. (Джон Керри  о Сирии).","ruDescription":"Игнорировать что-либо и делать вид, что не замечаешь этого."},{"vimeoId":"93053220","title":"to walk through","description":"\"To walk throug\": to guide in a thorough and carefull matter; to explain something to someone one step at a time","transcript":"﻿Wow, okay, this looks a bit more complicated than I'd imagined.  No, no, it's fine, alright. So I'll walk you through it? ","imgSrc":"http://i.vimeocdn.com/video/472988678_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053225","title":"to walk through","description":"\"To walk throug\": to guide in a thorough and carefull matter; to explain something to someone one step at a time","transcript":"Let me try kinda trying to walk and talk you through it.","imgSrc":"http://i.vimeocdn.com/video/472988682_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784738","title":"to wean off","description":"\"To wean somebody off something\": to make someone gradually stop using something that is bad for them.","transcript":"Many living scientists believe that our use of carbon is having a MARKED effect on the atmosphere and heating the planet. They think we need to capture it, store it and wean ourselves off it to move to a low-carbon economy.","imgSrc":"http://i.vimeocdn.com/video/475768639_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784780","title":"to weigh in","description":"\"To weigh in\": to offer an opinion in a discussion or argument.","transcript":"White House has mostly voted weighing in. I understand that teachers actually want the President to come out and support them.","imgSrc":"http://i.vimeocdn.com/video/475768629_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784763","title":"to weigh in","description":"\"To weigh in\": to offer an opinion in a discussion or argument.","transcript":"Here we go. He joined us from a newsweek magazine to weigh in with the conventional wisdom.","imgSrc":"http://i.vimeocdn.com/video/475768584_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784800","title":"to weigh in","description":"\"To weigh in\": to offer an opinion in a discussion or argument.","transcript":"He is going against his former Chief of staff Rahm Emanuel, the Mayor of Chicago. I asked Rahm Emanuel today at the press conference and he thinks his former boss President Obama should weigh in on this.","imgSrc":"http://i.vimeocdn.com/video/475768652_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053235","title":"to wreak havoc","description":"﻿\"To wreak havoc”: to cause really a lot of trouble with something.","transcript":"We’ll look at the growing problem of heroin, and how supply and demand are poised to wreak havoc on the streets of America.","imgSrc":"http://i.vimeocdn.com/video/472988745_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053227","title":"to wreak havoc","description":"﻿\"To wreak havoc”: to cause really a lot of trouble with something.","transcript":"How government abusive money can wreak havoc.","imgSrc":"http://i.vimeocdn.com/video/472988691_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053250","title":"to wreak havoc","description":"﻿\"To wreak havoc”: to cause really a lot of trouble with something.","transcript":"Islamist militants have been wreaking havoc in northern Nigeria.","imgSrc":"http://i.vimeocdn.com/video/472988754_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053261","title":"to zero in","description":"\"To zero in\" (on something): to focus your attention to one particular thing","transcript":"Promising new evidence in the crash of the West Caribbean flight 708 may help the investigative team to zero in on  the cause of the disaster.","imgSrc":"http://i.vimeocdn.com/video/472988758_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784848","title":"top of the bill","description":"\"Top of the bill\": to be at the top of the theater bill; to be headlining star of the show.","transcript":"I'll top the bill, I'll overkill, I have to fing the way to carry on… on with the show…","imgSrc":"http://i.vimeocdn.com/video/475768677_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784829","title":"top of the bill","description":"\"Top of the bill\": to be at the top of the theater bill; to be headlining star of the show.","transcript":"How do you feel up there? Top of the bill, fantastic.","imgSrc":"http://i.vimeocdn.com/video/475768667_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053276","title":"trick or treat","description":"\"Trick or treat\": traditional Halloween's phrase meaning \"Give me a treat of some kind or I will play a trick on you\".","transcript":"Winslow Massachusetts is among the cities asking everyone to postpone trick and treating until later in the week.","imgSrc":"http://i.vimeocdn.com/video/472988781_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053270","title":"trick or treat","description":"\"Trick or treat\": traditional Halloween's phrase meaning \"Give me a treat of some kind or I will play a trick on you\".","transcript":"Ok, so some kids may have skipped the haunted houses but the will definitely go to trick or treat in their neighborhoods. Halloween accounts for 25 percent of candy sales every year.","imgSrc":"http://i.vimeocdn.com/video/472988784_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87951256","title":"tug of war","description":"\"tug of war\" is a contest in which two teams pull against each other at opposite ends of a rope;a struggle for supremacy or control involving two antagonists","transcript":"...views look different to both Democrats and Republicans and we might just see a different kind of tug of war play out.","imgSrc":"http://b.vimeocdn.com/ts/466/216/466216097_100.jpg","ruTranscript":"…обе стороны, демократы и республиканцы видят эту ситуацию по-разному. И мы можем стать свидетелями того, что это противостояние в этот раз пройдет по иному сценарию.","ruDescription":"Соревнование по перетягиванию каната; борьба двух противников за лидерство или влияние."},{"vimeoId":"87951269","title":"tug of war","description":"\"tug of war\" is a contest in which two teams pull against each other at opposite ends of a rope;a struggle for supremacy or control involving two antagonists","transcript":"...tug of war between Iran and Britain over fifteen British sailors and marines seized and held in an undisclosed location after allegedly trespassing in Iranian waters.","imgSrc":"http://b.vimeocdn.com/ts/466/216/466216100_100.jpg","ruTranscript":"Противоборство между Ираном и Великобританией из-за того, что британские моряки и морпехи закрепились на участке, координаты которого не разглашаются, после того, как якобы нелегально вошли в иранские воды.","ruDescription":"Соревнование по перетягиванию каната; борьба двух противников за лидерство или влияние."},{"vimeoId":"87951240","title":"tug of war","description":"\"tug of war\" is a contest in which two teams pull against each other at opposite ends of a rope;a struggle for supremacy or control involving two antagonists","transcript":"...or a young Muslim woman who chooses to undergo painful surgery rather to admit to her family that she is no longer a virgin. Women in a tug of war between freedom and a life of secrets.","imgSrc":"http://b.vimeocdn.com/ts/466/216/466216089_100.jpg","ruTranscript":"…или молодая мусульманка, которая скорее перенесет болезненную операцию, чем признается своей семье, что она больше не девственница. Женщины находятся в эпицентре борьбы между свободой и жизнью, полной тайны и неизвестности.","ruDescription":"Соревнование по перетягиванию каната; борьба двух противников за лидерство или влияние."},{"vimeoId":"86387241","title":"turf","description":"a) A surface layer of earth containing a dense growth of grass and its roots;  b)Slang:  The range of the authority or influence of a person or a  group","transcript":"I’m sorry, Mrs. Johnson, my game, my turf, my rules.","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039244_100.jpg","ruTranscript":"Извините меня, госпожа Джонсон, моя игра, моя территория, мои правила.","ruDescription":"а) Слой почвы, с густой травой и её корнями. б)Сленг: территория под чьим-то управлением или контролируемая кем-либо."},{"vimeoId":"93053280","title":"U-turn","description":"\"U-turn\" 1) Literal a turn by vehicle in the shape of U (180 degrees), 2) A complete change of actions, a reversal of tactics","transcript":"﻿they would make a U-turn and they would go to the nearest… um, field.","imgSrc":"http://i.vimeocdn.com/video/472988843_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87409381","title":"under lock and key","description":"in a safe, protected place; please read and watch about \"family jewels\" in our library","transcript":"Oh he was nude in his own hotel room.That shoul be OK!You do have to be careful  of the family jewels though when you are royalty. I'm just saying you have to  keep those under lock and key.","imgSrc":"http://b.vimeocdn.com/ts/465/455/465455547_100.jpg","ruTranscript":"Он сидел голым в своем номере в гостинице. Это нормально, но нужно быть осторожным со своим хозяйством, если ты член королевской семьи. Я хочу сказать, нужно хранить их за семью замками.","ruDescription":"В безопасном, защищенном месте; пожалуйста, ознакомьтесь со значением идиомы \"family jewels\" в нашей коллекции."},{"vimeoId":"93053286","title":"under the barrel of the gun","description":"\"Under the barrel of the gun\": forcefully, unwillingly.","transcript":"The referendum that you regard as \"expressing the wish of the Crimean people\" was conducted under the barrels of Russian guns.","imgSrc":"http://i.vimeocdn.com/video/472988785_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053297","title":"under the barrel of the gun","description":"\"Under the barrel of the gun\": forcefully, unwillingly.","transcript":"This was a sham and illegal referendum conducted at the barrel of the Kalashnikov.","imgSrc":"http://i.vimeocdn.com/video/472988834_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"94166908","title":"under the barrel of the gun","description":"\"Under the barrel of the gun\": forcefully, unwillingly.","transcript":"All of this is gonna to be carried on on Sunday under the barrel of the gun.","imgSrc":"http://i.vimeocdn.com/video/474106742_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88092505","title":"until hell freezes over","description":"\"Until hell freezes over\" = forever","transcript":"In fact, it's been so cold that even Hell has frozen over. Residents in the small town of Hell in Michigan have been digging themslelves out of snow.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408748_100.jpg","ruTranscript":"На самом деле было так холодно, что даже ад замерз. Жители маленького города Хел (\"Ад\") в штате Мичиган выкапывают свои дома из снега.","ruDescription":"Навсегда."},{"vimeoId":"95784879","title":"up in the air","description":"\"Up in the air\": undecided about someone or something; uncertain about someone or something.","transcript":"Do you have a real chance of winning? For this friendly-neighbourhood spiderman that's still up in the air.","imgSrc":"http://i.vimeocdn.com/video/475768684_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88525389","title":"up in the air","description":"\"Up in the air\": not decided or completely developed. Please find info about another idiom used in this fragment in our library (in limbo).","transcript":"Who's in charge? Millions of Australians cast their ballots but the fate of the government is still up in  the air.","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014814_100.jpg","ruTranscript":"Кто будет главным? Миллионы австралийцев заполняют свои бюллетени, но судьба правительства все еще не разрешена.","ruDescription":"Нерешенный, недоработанный."},{"vimeoId":"86836871","title":"up the sleeve","description":"“Something up the sleeve” is a hidden advantage; some form of trickery lying in wait.","transcript":"Each big cat deploys its jaws and claws in a different way. And one of them has an extra weapon up its sleeve - but which one?","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658582_100.jpg","ruTranscript":"Каждая большая кошка пускает в ход свои клыки и когти по-своему.Но один из них припас дополнительное оружие - но кто же?","ruDescription":"Скрытое преимущество; некая уловка, ожидающая своего часа."},{"vimeoId":"86836848","title":"up the sleeve","description":"“Something up the sleeve” is a hidden advantage; some form of trickery lying in wait.","transcript":"Steenkamp was looking forward to spending Valentine’s Day with Pistorius twitting: “What do you have up your sleeve for your love tomorrow?”","imgSrc":"http://b.vimeocdn.com/ts/464/658/464658543_100.jpg","ruTranscript":"Стинкемп с нетерпением ожидала Дня Святого Валентина с Писториусом, написал тому в Твиттере: \"А что ты приготовил для своей любимой на завтра?\"","ruDescription":"Скрытое преимущество; некая уловка, ожидающая своего часа."},{"vimeoId":"87951289","title":"up to scratch","description":"\"up to scratch\"  - at an acceptable standard or quality","transcript":"The show is over, so it's time to ask: was the Sochi Games up to scratch?","imgSrc":"http://b.vimeocdn.com/ts/466/216/466216114_100.jpg","ruTranscript":"Итак, шоу окончено и пришло время спросить: прошли ли Олимпийские игры на должном уровне?","ruDescription":"В соответствии с определенным стандартом или определенного качества."},{"vimeoId":"93053322","title":"up to someone's neck into something","description":"\"Up to one's neck (in something)\": having a lot of something; very much involved in something.","transcript":"You come along and you pulled me through - now I'm up, up to my neck in you.  I been up to my neck in whiskey, I been up to my neck in wine, I been up to my neck in wishing that this neck wasn't mine.","imgSrc":"http://i.vimeocdn.com/video/472988849_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"93053310","title":"up to someone's neck into something","description":"\"Up to one's neck (in something)\": having a lot of something; very much involved in something.","transcript":"Up to my neck in misery for most of my life. I've been a fool, and I been up to my neck in pleasure,  up to my neck in pain. ","imgSrc":"http://i.vimeocdn.com/video/472988848_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"88525403","title":"up-and-coming","description":"\"Up-and-coming\": beginning to achieve success or popularity","transcript":"A stunning up-and-coming model.","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014817_100.jpg","ruTranscript":"Начавший добиваться успеха или популярности.","ruDescription":"Начавший добиваться успеха или популярности."},{"vimeoId":"89277146","title":"upper hand","description":"\"Upper hand\" (on someone): a position superior to someone; the advantage of someone.","transcript":"They do have the upper hand.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957982_100.jpg","ruTranscript":"Преимущество на их стороне.","ruDescription":"Положение, которые выше положения кого-либо; преимущество перед кем-либо."},{"vimeoId":"89277135","title":"upper hand","description":"\"Upper hand\" (on someone): a position superior to someone; the advantage of someone.","transcript":"Forces loyal to Libyan leader Muammar Gaddafi are getting the upper hand.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957975_100.jpg","ruTranscript":"Войска, поддерживающие лидера Ливии Муаммара Каддафи, побеждают.","ruDescription":"Положение, которые выше положения кого-либо; преимущество перед кем-либо."},{"vimeoId":"86387327","title":"vantage point","description":"A position or place that allows one a wide or favorable overall view of a scene or situation.","transcript":"Abu Dhabi sits at the crossroads of East and West. It is a meeting point in the twenty first century for business and trade. It’s a phenomenal vantage point to India and China.","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039363_100.jpg","ruTranscript":"Абу-Даби расположен между Востоком и Западом. Здесь встречаются торговля и бизнес. Это невероятная обзорная площадка для Индии и Китая.","ruDescription":"Позиция или место, которое предоставляет выгодный ракурс наблюдения происходящего."},{"vimeoId":"86387283","title":"vantage point","description":"A position or place that allows one a wide or favorable overall view of a scene or situation.","transcript":"- What was the eighties like from your vantage point? Was it all bacchanalian excess?  - Not from my vantage point.","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039341_100.jpg","ruTranscript":"- Что за время были 80-ые, по-твоему? Были ли они чересчур разгульными? - По-моему, нет.","ruDescription":"Позиция или место, которое предоставляет выгодный ракурс наблюдения происходящего."},{"vimeoId":"86387315","title":"vantage point","description":"A position or place that allows one a wide or favorable overall view of a scene or situation.","transcript":"From this vantage point you can see the refugee camp.","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039359_100.jpg","ruTranscript":"Отсюда хорошо видно лагерь беженцев.","ruDescription":"Позиция или место, которое предоставляет выгодный ракурс наблюдения происходящего."},{"vimeoId":"86387298","title":"vantage point","description":"A position or place that allows one a wide or favorable overall view of a scene or situation.","transcript":"… who are here with us at this vantage point, just by St. Paul's cathedral.","imgSrc":"http://b.vimeocdn.com/ts/464/039/464039347_100.jpg","ruTranscript":"...которые сегодня здесь, вместе с нами, прямо у собора Святого Павла.","ruDescription":"Позиция или место, которое предоставляет выгодный ракурс наблюдения происходящего."},{"vimeoId":"89277154","title":"walk of life","description":"A person's \"walk of life\" is the type of job they do or the level of society they belong to.","transcript":"Just over century since women first won the right to vote,  the BBC invites one hundred women from all walks of life to talk about the progress that has been made.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957987_100.jpg","ruTranscript":"Прошло чуть больше века с тех пор, как женщины получили право голосовать. Канал BBC пригласил 100 женщин разных профессий и разного социального положения, чтобы поговорить о переменах, которые произошли.","ruDescription":"Вид деятельности или положение в обществе."},{"vimeoId":"88525441","title":"what makes someone tick","description":"\"What makes someone tick\": something that motivates someone; something that makes someone behave in a certain way.","transcript":"It's hard to know what makes him tick, but how rich he really is?","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014853_100.jpg","ruTranscript":"Тяжело понять, что движет им, но насколько он на самом деле богат?","ruDescription":"Что-либо, что мотивирует кого-то, заставляет действовать определенным образом."},{"vimeoId":"88525454","title":"what makes someone tick","description":"\"What makes someone tick\": something that motivates someone; something that makes someone behave in a certain way.","transcript":"I'm going on South American journey and I want to know what makes this continent tick.","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014869_100.jpg","ruTranscript":"Я собираюсь в путешествие по Южной Америке, и я хочу узнать, чем там живут люди.","ruDescription":"Что-либо, что мотивирует кого-то, заставляет действовать определенным образом."},{"vimeoId":"88525462","title":"what makes someone tick","description":"\"What makes someone tick\": something that motivates someone; something that makes someone behave in a certain way.","transcript":"The culture, the economy - everything that makes this country tick.","imgSrc":"http://b.vimeocdn.com/ts/467/014/467014931_100.jpg","ruTranscript":"Культура, экономика - все, что движет этим континентом.","ruDescription":"Что-либо, что мотивирует кого-то, заставляет действовать определенным образом."},{"vimeoId":"93053333","title":"when in Rome do as Romans do","description":"\"When in Rome do like the Romans\": you should always consider local social standards.","transcript":"When in Rome do like the Romans. But Marty wasn't in Rome: Rome's in Italy.","imgSrc":"http://i.vimeocdn.com/video/472988870_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"87951302","title":"where there's a will there's a way","description":"Saying \"where there's a will there's a way\" is used to mean that if you are determined enough, you can find a way to achieve what you want, even if it is very difficult","transcript":"And she said reform was doable because where there's a will there was a way.","imgSrc":"http://b.vimeocdn.com/ts/466/216/466216123_100.jpg","ruTranscript":"И она заявила, что реформа выполнима, потому что где хотенье - там и уменье.","ruDescription":"Используется в значении \"если вы хотите чего-то, вы найдете способ добиться этого, даже если это трудно\"."},{"vimeoId":"95784913","title":"wild goose chase","description":"\"Wild goose chase\": a pursuit of something unattainable or of something as unlikely to be caught as the wild goose.","transcript":"Were you surprised by what you have found? Of course it's also very surprising: to go on a…  on a… you know, what some people might have characterized as a wild goose chase and to actually find the goose. So yes, we were very surprised.","imgSrc":"http://i.vimeocdn.com/video/475768832_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"95784940","title":"winds of change","description":"\"Winds of change\":The winds of change is an expression that symbolizes revolutionary changes that come into  effect within the world, a country, a system, organization or group.","transcript":"The winds of change are indeed upon the holy sea as Pope Francis looks to implement those reforms.","imgSrc":"http://i.vimeocdn.com/video/475768858_100x75.jpg","ruTranscript":"","ruDescription":""},{"vimeoId":"89277168","title":"wishful thinking","description":"\"Wishful thinking\": thinking or talking about something that you would very much like to happen  although you know it probably will not happen","transcript":"I like this one in particular because perhaps it's wishful thinking. It's the graffiti that says if you translate it:  after the revolution we will break essentially the AK-47.","imgSrc":"http://b.vimeocdn.com/ts/467/957/467957992_100.jpg","ruTranscript":"Особенно мне нравится вот это, возможно, потому что я хочу принимать желаемое за действительное. Это граффити переводится как \"после революции, мы уничтожим свои АК-47\".","ruDescription":"Думать или говорить о чем-либо, чего хочется, но в то же время понимать, что скорее всего этого не произойдет."},{"vimeoId":"88092560","title":"work cut out","description":"If you have your work cut out, you have something very difficult to do.","transcript":"And the 2014 Olympic Winter games are exactly one year away. But the whole city has its work cut out for it.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408865_100.jpg","ruTranscript":"До Олимпийских игр остался ровно год. Но подготовка требует всех ресурсов всего города.","ruDescription":"Иметь перед собой трудную задачу."},{"vimeoId":"88092532","title":"work cut out","description":"If you have your work cut out, you have something very difficult to do.","transcript":"But the task ahead is daunting. We've got your work cut out for you.","imgSrc":"http://b.vimeocdn.com/ts/466/408/466408847_100.jpg","ruTranscript":"Стоящая перед нами задача пугает. У нас для вас трудное задание.","ruDescription":"Иметь перед собой трудную задачу."},{"vimeoId":"95784970","title":"written in the stone","description":"\"Written in the stone\": permanent, not a subject to change. ","transcript":"The whole point of the end the cold war was the understanding that NATO would not spread eastwards. That was not written down in stone but it was the understanding. Unfortunately NATO started to move eastwards.","imgSrc":"http://i.vimeocdn.com/video/475768869_100x75.jpg","ruTranscript":"","ruDescription":""}]
